{"100 Proof":[{"bio":"Known for their high energy performance and catchy chorus lines, OneHundred Proof is on the brink of taking their music to the next level. Blending Rock and Hip Hip music with a touch of blues harmonica, OneHundred Proof is definitely captivating audiences and fans at every show. After attending one of their concerts you will leave with a better understanding of what the buzz is all about!! OneHundred Proof has shared the stages with acts such as; Rehab, Big B, Too Short, DJFM of The Psycho Realm, T-Mills, Rick Thorn, Shiny Toy Gunns and Strung Out. They have also had the pleasure of performing at venues and festivals such as; 2012 Venice Beach Music and Arts Festival, 2012 Ink For A Cause in Ventura, 2010 Comic Con After Party, House Of Blues Anaheim and Hollywood, The Famous Whisky A-Go-Go, Viper Room, Fox Theater in Pomona, and numerous venues in the Inland Empire. OneHundred Proof will continue to ROCK stages and give their fans what they come to see, A SHOW!!! You can see what type of impact they have on their fans as the venues tend to flood with OneHundred Proof Skull and Cross Bone shirts and black Bandanas swinging in their air, It is not uncommon to hear their crowd chanting OneHundred Proof before they hit the stage."}] ,
    "200 West": [{"bio":"Fresh off the release of their collection of songs called 5 Leagues Under 200 West has been moving through their musical journey in pursuit of crafting and sharing their West Coast based sound.  Since the band formed in 2005, 200 West has made it a point to not place any limitations on style, tone and expression. Originally known as an acoustic band with just 2 guys, and 2 acoustic guitars.  The group solidified its current lineup with Greg, Adam, Jon and Chris in 2010.  After releasing both their full-length album The Season and their ep The Metropolitan Sessions 200 West set out to tour the entire US for 5 months in 2012.  After playing 100s of shows and living on the road for nearly half a year in 2012, the band has stationed themselves back home in Southern-California.  200 West will be heading out on a West Coast Tour in summer 2013."}] ,
    "A City Serene": [{"bio":"Throughout a bands career, adversity is to be expected. However, few bands experience the trials and tribulations A CITY SERENE has faced. After a promising start to their career, A CITY SERENE was derailed by a tragic car accident on their first tour, one that left the state of the band in shambles. Shaking off their maladiesincluding a comavocalist Carly Baker and guitarist Kris Renfro persevered… refusing to accept defeat. Born anew with the installation of Nick DiTomaso (Synthesizer/Vocals), Kai Taylor (Drums), Angel Saldivar (Bass) and Angel Garcia (Guitar), A CITY SERENE is back and better than ever with their newest EP THE WIDOWS WALK. THE WIDOWS WALK demonstrates the band taking their brand of post-hardcore to new heights, using all the tools in their arsenal to construct an impressive compilation of mosh pit anthems and infectious sing alongs. Though a part of an oversaturated scene, A CITY SERENE offers more than the countless derivatives in the post-hardcore genre. THE WIDOWS WALK features a diverse sonic palette, from catchy pop-inspired choruses to heavy dubstep infused breakdowns. Bakers smooth and angelic vocals juxtapose DiTomasos blood-curdling screams well, keeping the tracks cohesive and engaging. Ultimately, THE WIDOWS WALK is a bone-shattering EP that should satisfy any post-hardcore fix. Dont call it a comeback. Theyre only finishing what they started"}] ,
    "Amariah": [{"bio":"Amariah, a diverse rock band hailing from different ends of the Inland Empire, are out to share their sound with music lovers. Focusing on writing colorful melodies over colorful progressions, mixing Jazz influences with the more progressive end of music to create a sound rarely, if at all, heard before."}] ,
    "Anthony B": [{"bio":"Draped in the rich colours of African cloth, his trademark staff in hand, and his dreadlocks wrapped regally on his head, Anthony B embodies all that it is spiritual and proactive about Reggae music. This artiste has been steadfast in his mission to represent the poor and oppressed, using sharp lyrics to confront political injustices and bring the issues of the people to the forefront. In the process, he has raised the quality of performance standards and lyrical content for the industry, through the release of 13 albums, over 1000 singles and appearances on over 100 albums in the last 14 years. Anthony Bs musical journey started in the church, back when he was still called Keith Anthony Blair in Clarks Town, Trelawney. In this part of rural Jamaica, Anthony B was immersed in the thunderous chants and rhythms of Revivalism and the Seventh Day Adventist church where he honed his soon-to-be signature vocals. In his formative years, the artiste also cleaved to the music of Otis Redding and the incomparable Peter Tosh.In 1992, Anthony B left his home-town and set out to make his fateful mark on Kingstons music scene. He rebuked the trend of girl and gun lyrics popular at that time and remained faithful to words of spiritual consciousness and social conviction. He started working with singer Little Devon, who introduced him to Richard Bell Bello, of Star Trail Records, producer for Garnet Silk and Everton Blender. Bell saw the talent of the youngster and shared his commitment to conscious music. The partnership produced a slew of records and releases.  He produced 3 albums independently; Street Knowledge, Thats Life and Life Over Death. In addition he released two collaboration albums Too Strong with Sizzla and Three Wise Men with Sizzla and Luciano. Anthony Bs lyrical genius and his captivating, energetic performance style have caused him to be heavily requested for performances in the Caribbean, North America, Europe and Africa. Anthony B personally rates his performance in 1999 at the Montrose Jazz Festival as a monumental event in his career. In 2003 and 2004, he was given a Kings welcome in Gambia and Senegal. In 2004, he sold out shows in Switzerland, Austria, Sweden, Belgium, France, Italy and Germany; closing for such greats as Israel Vibration and Burning Spear. He also opened up new regions for reggae music through his performances in New Dehli, India, Czech Republic, Iceland, Argentina, Venezuela and on Frances Reunion Island, in the Indian Ocean. His heavy touring schedule has not slowed Anthony Bs stream of releases. Over the years, he has collaborated with Bone Crusher, Akon, Wyclef Jean, Snoop Dogg, R. Kelly, Martina, an on his latest album, Toots. Anthony Bs rich vocals and audacious lyrics carry a depth and substance which is rare in the industry. Internationally, his fan-base has grown because he speaks about the universal concerns of suffering and salvation. The greatest thing about reggae music is that its about concepts and ideas, says the artiste, you are speaking to people on issues they live and can relate to. "}] ,
    "Apryle Dalmacio": [{"bio":"Apryle Dalmacio is a self taught singer/songwriter who has captivated the hearts of the Inland Empire as award-winning BEST COUNTRY and BEST FEMALE ARTIST for the 2009 INLAND EMPIRE MUSIC AWARDS. This aspiring artist has been on stage all her life dreaming that some day her music will inspire and captivate listeners and viewers across the world. It is her powerful, dynamic, and expressive voice that has brought her this far. She has performed for The Female Acoustic Showcase featuring several award winning female artists from across Southern California, as well as the opening celebration of the Musical Instruments sponsored by Best Buy, and has had the honor to humbly perform for charity events including The American Cancer Societys Relay For Life. In 2007, she came home as a third place winner from a Battle of the Bands held in one of L.A.s most famous venues BB Kings Blues Club at Universal City Walk and had the honor to celebrate her Filipino heritage at the annual Fil-Am ARTS in San Pedro. Apryle has had the opportunity to be featured on several types of respected publications and media from the United States to the Philippine Islands and has been an innovation to journalists in the Inland Empire Weekly, the Press Enterprise, and Philippines most prime media networks GMA7 news where her biography became a world wide story through television, print, and the Web. Her music has aired on several radio stations including X103.9 FM, KUCR 88.3fm with DJ Tina Bold, IE Coffee Radio KCAA 1050am with Ralph Torres, Inland Empires talk radio KTIE 590am with Coffee General Cliff Young, and Cut N Dry Talent Radio with Chris Kalt. Her talents have even given her a spotlight in her own radio show as a Voice Over and On-Air Talent for Cal State San Bernardinos Coyote Radio. "}] ,
    "At The Skylines":  [{"bio":"At The Skylines was formed in 2009 and play post-hardcore. Theyre all based in Southern California around Huntington Beach. They produced a self titled EP in 2009 with producer Kris Comeaux. Theyre a six-piece band who write from their souls. They recently got signed to Roadrunner Records and their debut album will be named The Secrets To Life and its set to release May 8. Their live show boasts two incredibly talented front men that completely cover the brutality of metal while still bringing forth the catchiness of near pop status choruses in a way that can still be presented tastefully and admirably. Energetic would be a lackluster way of describing their live performance, which is driven by non-stop interaction between band and crowd. No one on stage is standing still, and neither is the crowd. The music captures great melody, yet is technically sound enough to achieve respect and loyalty from fans across multiple genres. Overall, its the songs that are going to get the band to connect with their audience and ultimately point them to success. The lyrical content isnt short-sighted or based around petty topics. This is a mature band with a mature sound that has put together real songs. "}] ,
    "Back Yard Pimps":  [{"bio":"Back Yard Pimps music is a pure fusion of Rock, Hip-hop, Soul, and life. There are no boundaries we adhere to in life and BYP music proves that there are no boundaries in music."}] ,
    "Bad Brains": [{"bio":"Born in Washington D.C. in the fall of 1978, members Paul (H.R.) Hudson (Voice) his brother Earl (Drums), Gary (Dr.Know) Miller (Guitar) and Darryl Jenifer (Bass), came together like the Ninja Turtles, when they were exposed to a suspicious green goo while working at various research centers throughout the Washington Metropolitan area, eventually Bad Brains were banned in D.C."}] ,
    "Barrington Levy": [{"bio":"One of the great success stories of the 80s, arrived on the dancehall scene and swiftly remodeled it in his own image. Although numerous DJs and vocalist would rise and fall during this decade, Levy was one of the few with staying power, and he continued releasing massive hits well into the 90s. Born in Kingston, Jamaica, as a youngster, Barrington Levy formed the Mighty Multitude with his cousin Everton Dacres. They started off playing the sound systems and cut their first single, My Black Girl, in 1977. All of 14, Levy broke out his own the next year and recorded his debut solo single, A Long Time Since We Dont Have No Love. It didnt have much of an impact, however the teens appearances in the dancehalls were eagerly awaited events. It was at one of these that Levy met former singer turned producer Junjo Lawes and Mew York-based producer Hyman Jah Life Wright. The pair took the youth into King Tubbys studio, accompanied by the Roots Radics, and recorded a clutch of cuts. The first fruits of this union were Ah Yah We Deh, quickly followed by Looking My Love, and  Wedding Ring Aside. Success was immediate, but it was the mighty Collie Weed that really cemented the teens hold of dancehall. Shine Eye Girl, was a smash follow up, and the young Levy was now in great demand. A stream of singles followed Jumpy Girl, a lovely version of Horace Andys Skylarking, Reggae Music, Levy joined forces with producer Alvin Ranglin for another sting of hitsNever Tear My Love Apart, Jah, You Made Me So Happy, and When Youre Young and in Love. Levys rich vocals were made for duets, both with other vocalists and DJs , and it wasnt long before the young star was also recording collaborative singles. Toyan was a great foil on Call You on the Phone, he paired with Jah Thomas on Moonlight Lover and Sister Debby, and joined forces with Trinity for Lose Respect and a follow-up, I Need a Girl in 1980. That same year, Levy made a sensational appearance at Reggae Sunsplash, then returned in 1981. During these early years, the singer seemingly spent all of his time between the recording studios and the dancehalls. Amidst the deluge of singles, four albums arrived as well between 1979 and 1980. First up was Bounty Hunter, which boosted three smash singlesReggae Music, Shine Eye Girl, and Looking My Love –and a clutch of other tracks that were just about as good. In Britain, the Burning Sounds label released Shine Eye Gal, also a hits heavy package which included the title track-track, Collie Weed, and Ah Yah We Deh It was swiftly followed by the mighty Englishman, an absolutely fabulous record which was overseen by the unbeatable studio grouping of Junjo Lawes and two of King Tubbys protégésScientist and Prince Jammy. A veteran of the clubs, he brought the spontaneity of the DJ to his records while returning vocals back to the sound system scene which had been purely the realm of the Djs. Utilizing old roots rhythms revitalized by the Radics, and giving the songs a hard, but danceable edge, Lawes and Levy together helped establish a whole new dancehall sound. 1980s Robin Hood merely affirmed that everyone in Jamaica already knew: That Levy was now the biggest star on t he island, with a talent that was unbeatable. Or more accurately, he was king of the singers, because ruling beside him was DJ Yellowman, another Lawes discovery, that was brought to him by Barrington Levy. Robin Hood was as big as its predecessor and was beginning to have an impact in Britain as well, where both it and Englishman had been released by the Greensleeves label. Not surprisingly, both albums heavy rhythms would provide the building blocks for the Scientist V Prince Jammy dub clash album. Unfortunately, Levys very popularity was now beginning to have some serious drawbacks. Even before stardom arrived, the singer had noticed with delight fans tapping his sets at the dancehalls, and these tapes were coming back to haunt him. Suddenly, the shelves were buckling under the weight of the bootlegged albums, featuring not just older pirated live material, but also unreleased outtakes and recycled older singles. In response, Levy didnt release a new album for two years, but in the meantime, new singles more then made up for it. From 1980 came such hits as the haunting Lawes-produced Mary Long Tongue producer Linval Thompsons Too Poor, and a string if hits cut with Karl Pitterson, including  I Have a Problem and Even Tide Fire a Disaster. And as the decade progressed, the flood hits continued. Im Not in Love, You Have It, Tomorrow Is Another Day, Robberman, BlackRose My Women, and Money Move were just a small number of the hits released between 1981 and 1983, with the latter song the biggest smash of the batch. Levy even tried his hand at self-production, recording such excellent songs as In the Dark and Love of Jah. Amongst there were fabulous singles recorded for Joe Gibbs, My Women included. The Reggae Vibes album would bundle up Levys best with the producer, s well a number of cuts from fellow dancehall singer Sammy Dread. 1983 finally saw the release of Levy album Money Move. The latter was excellently overseen by George Phang and boasted a stupendous group of rhythms that Sly & Robbie had specifically made for the producer. In the U.K, the burning sounds label also released Hunter Man, a greatest-hits collection. But the hits were still coming on strong; in 1984 none were bigger then Levy and Jah Screw produced Under Mi Sensi. The pair would also record a new album that year, Here I come, whose title-track would the top 50 in the U.K The album itself took Britain by storm and ensured that Levy walked away with the best Vocalist Award at Britains Reggae Awards. It was also these songs that secured his spot in the Guinness Book of World Records, as the first reggae artist to hold both 1st and 2nd place slots in the charts. The same year, the singer also joined forces with another young singer who was tearing up the dance floors, Frankie Paul, for the intriguing sound clash set Barrington Levy meets Frankie Paul. 1985 brought Prison Oval Rock (the Volcano Jamaican label release, and not to be confused with the RAS labels U.S. compilation of the same title), which found the singer joining forces with Lawes again, for another roots-fired set equal to its predecessors. It had been six years since Levy burst onto the scene with all the force of a nuclear weapon. Now in his early twenties, the singers output significantly began to slow. He did return to Reggae Sunsplash in 1987 and would remain a top attraction at the festival until 1985. He also released Love the Life you Live in 1988, a rather patchy effort compared to previous releases. It was to be his last new album until 1991. But Levy wasnt a spent force yet. Before the 80s were over, he scored tow more hits with My Time and Too Experience, both under the aegis of producer Jah Screw, and both covers of songs written by Bob Andy (ex-Paragons and also of Bob & Marcia fame). Signing with MCA in t he U.S., Levy attempted to cross over into the North American market with 1983s Barrington. Produced by Lee Jaffe, the Album featured a re-recorded Under Mi Sensi, and boasted strong songs as Murderer and Vice Versa Love and Be Strong, a major hit in the Caribbean and South America. However, the relationship with MCA was not a happy one and Levy quickly departed. Meanwhile, back in Britain, the singer was chalking up another hit with Work. In 1994, Levy was joined by Beenie man on the singles Two Sounds and Murderer. Both soon reappeared as fiery jungles remixes, with Sensi, in particular, mashing up the dance floors. Under Jack Scorpios direction, the singer next paired with Mega Banton for Shes Mine. Jah Screw took these collaborations to the next logical step, and recorded an entire album and recorded and entire album of shared songs, Duets (this is its American title and it was released in the U.s. by RAS, and in the U.K., Levys relationship with Greensleeves continued, where the album there was titled Barrington Levys DJ Counteraction). From this set, Living Dangerously with Bounty Killer rocketed up the Jamaican charts and set pace at clubs around the world . Time Capsule came hot on its heels in 1996, a short album (a mere eight tracks plus five dubs), which more than made up for lack of quantity with quality. Over the next two years, his circle of friends was obviously growing, and 1998s re-make of Murderer featured such diverse artists as rap master Snoop Doggy Dogg and Southern California punk-reggae heroes Long Beach Dub All-Stars. In 2003, his debut album Bounty Hunter was reordered and reissued as Moonlight Lover on the Burning Bush label. Two years later, the Sanctuary label collected his recordings with Henry Lawes and Alvin Ranglin for Love Your Brother man: The Early Tea. Numerous compilations have continued to appear featuring much of the singers greatest work. He was also featured in 2000 on rapper on Shynes debut album Bad Boyz, with two singles Bad Boyz which was number 1 on the hip-hop charts, and Bonnie and Shynz.One of the great success stories of the 80s, arrived on the dancehall scene and swiftly remodeled it in his own image. Although numerous DJs and vocalist would rise and fall during this decade, Levy was one of the few with staying power, and he continued releasing massive hits well into the 90s. Born in Kingston, Jamaica, as a youngster, Barrington Levy formed the Mighty Multitude with his cousin Everton Dacres. They started off playing the sound systems and cut their first single, My Black Girl, in 1977. All of 14, Levy broke out his own the next year and recorded his debut solo single, A Long Time Since We Dont Have No Love. It didnt have much of an impact, however the teens appearances in the dancehalls were eagerly awaited events. It was at one of these that Levy met former singer turned producer Junjo Lawes and Mew York-based producer Hyman Jah Life Wright. The pair took the youth into King Tubbys studio, accompanied by the Roots Radics, and recorded a clutch of cuts. The first fruits of this union were Ah Yah We Deh, quickly followed by Looking My Love, and  Wedding Ring Aside. Success was immediate, but it was the mighty Collie Weed that really cemented the teens hold of dancehall. Shine Eye Girl, was a smash follow up, and the young Levy was now in great demand. A stream of singles followed Jumpy Girl, a lovely version of Horace Andys Skylarking, Reggae Music, Levy joined forces with producer Alvin Ranglin for another sting of hitsNever Tear My Love Apart, Jah, You Made Me So Happy, and When Youre Young and in Love. Levys rich vocals were made for duets, both with other vocalists and DJs , and it wasnt long before the young star was also recording collaborative singles. Toyan was a great foil on Call You on the Phone, he paired with Jah Thomas on Moonlight Lover and Sister Debby, and joined forces with Trinity for Lose Respect and a follow-up, I Need a Girl in 1980. That same year, Levy made a sensational appearance at Reggae Sunsplash, then returned in 1981. During these early years, the singer seemingly spent all of his time between the recording studios and the dancehalls. Amidst the deluge of singles, four albums arrived as well between 1979 and 1980. First up was Bounty Hunter, which boosted three smash singlesReggae Music, Shine Eye Girl, and Looking My Love –and a clutch of other tracks that were just about as good. In Britain, the Burning Sounds label released Shine Eye Gal, also a hits heavy package which included the title track-track, Collie Weed, and Ah Yah We Deh. It was swiftly followed by the mighty Englishman, an absolutely fabulous record which was overseen by the unbeatable studio grouping of Junjo Lawes and two of King Tubbys protégésScientist and Prince Jammy. A veteran of the clubs, he brought the spontaneity of the DJ to his records while returning vocals back to the sound system scene which had been purely the realm of the Djs. Utilizing old roots rhythms revitalized by the Radics, and giving the songs a hard, but danceable edge, Lawes and Levy together helped establish a whole new dancehall sound. 1980s Robin Hood merely affirmed that everyone in Jamaica already knew: That Levy was now the biggest star on t he island, with a talent that was unbeatable. Or more accurately, he was king of the singers, because ruling beside him was DJ Yellowman, another Lawes discovery, that was brought to him by Barrington Levy. Robin Hood was as big as its predecessor and was beginning to have an impact in Britain as well, where both it and Englishman had been released by the Greensleeves label. Not surprisingly, both albums heavy rhythms would provide the building blocks for the Scientist V Prince Jammy dub clash album. Unfortunately, Levys very popularity was now beginning to have some serious drawbacks. Even before stardom arrived, the singer had noticed with delight fans tapping his sets at the dancehalls, and these tapes were coming back to haunt him. Suddenly, the shelves were buckling under the weight of the bootlegged albums, featuring not just older pirated live material, but also unreleased outtakes and recycled older singles. In response, Levy didnt release a new album for two years, but in the meantime, new singles more then made up for it. From 1980 came such hits as the haunting Lawes-produced Mary Long Tongue producer Linval Thompsons Too Poor, and a string if hits cut with Karl Pitterson, including  I Have a Problem and Even Tide Fire a Disaster. And as the decade progressed, the flood hits continued. Im Not in Love, You Have It, Tomorrow Is Another Day, Robberman, BlackRose My Women, and Money Move were just a small number of the hits released between 1981 and 1983, with the latter song the biggest smash of the batch. Levy even tried his hand at self-production, recording such excellent songs as In the Dark and Love of Jah. Amongst there were fabulous singles recorded for Joe Gibbs, My Women included. The Reggae Vibes album would bundle up Levys best with the producer, s well a number of cuts from fellow dancehall singer Sammy Dread. 1983 finally saw the release of Levy album Money Move. The latter was excellently overseen by George Phang and boasted a stupendous group of rhythms that Sly & Robbie had specifically made for the producer. In the U.K, the burning sounds label also released Hunter Man, a greatest-hits collection. But the hits were still coming on strong; in 1984 none were bigger then Levy and Jah Screw produced Under Mi Sensi. The pair would also record a new album that year, Here I come, whose title-track would the top 50 in the U.K The album itself took Britain by storm and ensured that Levy walked away with the best Vocalist Award at Britains Reggae Awards. It was also these songs that secured his spot in the Guinness Book of World Records, as the first reggae artist to hold both 1st and 2nd place slots in the charts. The same year, the singer also joined forces with another young singer who was tearing up the dance floors, Frankie Paul, for the intriguing sound clash set Barrington Levy meets Frankie Paul. 1985 brought Prison Oval Rock (the Volcano Jamaican label release, and not to be confused with the RAS labels U.S. compilation of the same title), which found the singer joining forces with Lawes again, for another roots-fired set equal to its predecessors. It had been six years since Levy burst onto the scene with all the force of a nuclear weapon. Now in his early twenties, the singers output significantly began to slow. He did return to Reggae Sunsplash in 1987 and would remain a top attraction at the festival until 1985. He also released Love the Life you Live in 1988, a rather patchy effort compared to previous releases. It was to be his last new album until 1991. But Levy wasnt a spent force yet. Before the 80s were over, he scored tow more hits with My Time and Too Experience, both under the aegis of producer Jah Screw, and both covers of songs written by Bob Andy (ex-Paragons and also of Bob & Marcia fame). Signing with MCA in t he U.S., Levy attempted to cross over into the North American market with 1983s Barrington. Produced by Lee Jaffe, the Album featured a re-recorded Under Mi Sensi, and boasted strong songs as Murderer and Vice Versa Love and Be Strong, a major hit in the Caribbean and South America. However, the relationship with MCA was not a happy one and Levy quickly departed. Meanwhile, back in Britain, the singer was chalking up another hit with Work. In 1994, Levy was joined by Beenie man on the singles Two Sounds and Murderer. Both soon reappeared as fiery jungles remixes, with Sensi, in particular, mashing up the dance floors. Under Jack Scorpios direction, the singer next paired with Mega Banton for Shes Mine. Jah Screw took these collaborations to the next logical step, and recorded an entire album and recorded and entire album of shared songs, Duets (this is its American title and it was released in the U.s. by RAS, and in the U.K., Levys relationship with Greensleeves continued, where the album there was titled Barrington Levys DJ Counteraction). From this set, Living Dangerously with Bounty Killer rocketed up the Jamaican charts and set pace at clubs around the world . Time Capsule came hot on its heels in 1996, a short album (a mere eight tracks plus five dubs), which more than made up for lack of quantity with quality. Over the next two years, his circle of friends was obviously growing, and 1998s re-make of Murderer featured such diverse artists as rap master Snoop Doggy Dogg and Southern California punk-reggae heroes Long Beach Dub All-Stars. In 2003, his debut album Bounty Hunter was reordered and reissued as Moonlight Lover on the Burning Bush label. Two years later, the Sanctuary label collected his recordings with Henry Lawes and Alvin Ranglin for Love Your Brother man: The Early Tear. Numerous compilations have continued to appear featuring much of the singers greatest work. He was also featured in 2000 on rapper on Shynes debut album Bad Boyz, with two singles Bad Boyz which was number 1 on the hip-hop charts, and Bonnie and Shynz."}] ,
    "Bears Eat Me": [{"bio":"Bears Eat Me first formed in Fontana, California on July 7th of 2008. The band originally thought of naming themselves Salmon after an inside joke from high school but after discovering the name was already taken by numerous other bands, the group decided to go a more creative route and came up with the name Bears Eat Me. Shortly after the groups formation, they hit turbulent waters as band mates began dropping out of the group. After three years, two singers, three rhythm guitarists, three bassists, and two drummers, the band ended up with their current line up containing Ezra Echt as the Vocalist, James Osyris on Lead Guitar, Thinzar on Rhythm Guitar, Garrick on the Drums, and are currently looking for a new bassist. Bears Eat Me is very active in their local music scene in Fontana. Recently at a show one of the band members was told by another group, We kept seeing your name everywhere and kept wondering, who is Bears Eat Me?. If the group is not playing at venues like The Glasshouse in Pomona or The Knitting Factory in Los Angeles, then you will most likely find them playing events for their good friend DJPJ of Indie 104. Bears Eat Me released their first five song EP entitled Listen to This on May 22 of 2010. The most well received song from the album, The End of a Fairytale, was the first song written with Ezra in the band and is written about the true story of the vocalists battle for her first love and her attempts to move forward without him in her life. This song has also received some radio play on the local radio station X 103.9 during their Pay to Play event, on Indie 104, and on FlashRock.com. Bears Eat Me released a demo of their song Cancer in early 2012. They plan to go back into the studio to record two new songs in late May!"}] ,
    "Beat Sexy Beat": [{"bio":"With little more than an idea and aspirations of superstardom, lifelong friends Chris Glaubig and Fady Aridi took on the enormous challenge of creating music that would be loved by others while remaining true to their roots and influences. Locked away from the world, the duo set their vision in motion and recruited a number of band members over the years, though none seemed to last very long. Finally they were successful in finding 3 individuals with a shared commitment and dedication to music, wandering minstrel/guitarist Nate, a pirate/bassist named Nico, and a poet/singer known as Nadi. With these 3 individuals completing the sound Fady and Chris were searching for, beatsexybeat was born. The distinctly unique influences and backgrounds of each member have melded together to create a new genre called Stadium Indie Rock, providing people with both emotionally charged anthems and infectious dance hits. Whether youre a longtime fan or youve just recently stumbled across us, we hope that youll enjoy the music weve worked so hard to create, and will help us in sharing our passion for music with the world."}] ,
    "Beatsteaks": [{"bio":"Beatsteaks is a German alternative rock/punk band founded in 1995 and residing in Berlin, Germany. The original line-up consisted of Arnim Teutoburg-Weiß (vocals & guitar), Bernd Kurtzke, Peter Baumann (both guitar), Ali (bass) and Steffi (drums). After the release of their first album 48/49 (1996) Steffi left the band and was replaced by Thomas Götz.  Ali left the band after they released their second album Launched (1999) and so Torsten Scholz became the new bass player.  Their first album was released on XNO, an Indie label from berlin. Launched and Living Targets (2002), were both released on Epitaph. Since their fourth album Smacksmash (2004) they are signed by the major label Warner. In 2006 they released their first DVD, B-Seite, and their new album .limbo messiah was released in March 2007.  Furhtermore, they released a Demo CD in 1995, the very rare 7 vinyl Knaack EP (1997) and the limited Wohnzimmer EP (2002). While their first two albums were influenced by punk rock, the roots of the later records lie within the rock/alternative genre. With the release of their song Let Me In from the album Living Targets they became famous in the national and international rock scene. With their album Smacksmash and its singles Hand in Hand, I dont care as long as you sing and Hello Joe but also with their new album-tracks, Cut off the top, Jane became insane and She was great they entered the german charts and got their national breakthrough."}] ,
    "Beenie Man": [{"bio":"Anthony Moses Davis (born August 22, 1973 in Kingston, Jamaica), better known by the stage name Beenie Man, is a well established reggae artist and DJ. He was involved in the music industry from a young age when he won the Tastee Talent contest in 1981. Only one year later, when he was eight years old, he recorded a single, Too Fancy, with record producer Junjo Lawes. By 1983, Beenie Man was recording with heavyweight DJs, such as Dillinger and Fathead and released his debut album, The Invincible Beenie Man: The Ten Year Old DJ Wonder and the single Over the Sea.  He was booed off stage at a show celebrating the visit of Nelson Mandela. In 1993 at the very popular show Sting he accused fellow deejay Bounty Killer that the elder artist had stolen his catchphrase, people dead. This triggered a lyrical battle which continued on the air with each artist counteracting the others songs. Finally, in 1995, Beenie Man and Bounty Killer settled their differences on the air by actually signing a peace treaty and the two recorded an album together, Guns Out. This was followed by a single, No Mama No Cry, a rehash of the Bob Marley classic No Woman No Cry, speaking out against violence and inspired by the murder of Pan Head, another popular Deejay. Partially as a result of prodding from his producers, Sly and Robbie, Beenie Man soon converted to the Rastafari movement. In 1994, he was signed by Island Records and released the critically acclaimed album Blessed."}] ,
    "Beyond Rythem": [{"bio":"In the summer of 2000 out of Riverside California Beyond Rhythm is born. A love for Reggae, Dub, & Ska music, gave inspiration to come together and create an original band with a positive sound. Performing at various venues in California and getting to share the stage w/ some reggae greats such as the Wailing Souls, Inner Circle, Pato Banton, Yami Bolo, Sister Carol, Frankie Paul, Elephant Man, Garth Dennis, Black Uhuru, Big Mountain, & Rankin Joe to name a few thru out the years. Using music as a tool for equal rights and justice and speaking for the voice of this generation. Delivering a message Beyond The Rhythm…"}] ,
    "Big Papa and The": [{"bio":"No bio available"}] ,
    "Black Uhuru": [{"bio":"Black Uhuru is a Jamaican reggae band probably best known for their hits Shine Eye Gal, Guess Whos Coming to Dinner, Sinsemilla, Solidarity, and What Is Life?. They were the first group to win a Grammy in the reggae category when it was introduced in 1985. They originally formed as ‘Black Sounds Uhuru (the Kiswahili word for freedom). The first line-up of the group was Garth Dennis, Don Carlos, and Derrick Duckie Simpson. The group has undergone several lineup changes: Carlos left, replaced by Michael Rose; then Dennis left to play with The Wailing Souls, and was replaced by Errol Nelson. During this early period, the bands most famous recording is the album entitled Love Crisis, later rereleased as Black Sounds Of Freedom. In 1979 the group was joined by Sandra Puma Jones, a social worker from North Carolina, USA. Under this lineup, (Rose, Simpson and Jones), with Sly & Robbie as producers (and also permanently employed on drum and bass), they released the bands most popular albums: Sinsemilla, Red, Chill Out, and the Grammy-winning Anthem¹, as well as others. During this period, Black Uhuru became one of the most popular reggae groups in the world, regularly touring with the likes of The Police and The Rolling Stones. Live 1984 (a concert at the Rockpalast in Germany, but was actually recorded on October 18, 1981) captures the band at the height of its powers."}] ,
    "Black Velvet Sun": [{"bio":"Black Velvet Sun was an American alternative rock band that was formed by five students attending the University of California at Santa Barbara, California in 2007. While influenced by a large range of music (everything from electronica to classical to trip-hop), they saw the basis of their sound as rock. The band decided to part ways in 2012 and lead singer, Analise Nelson went on to form her electropop solo project, Anabot."}] ,
    "Bob Marley": [{"bio":"Bob Marley (February 6, 1945 - May 11, 1981), born Nesta Robert Marley which was later to be changed by passport officials to Robert Nesta Marley, was a Jamaican singer-songwriter, guitarist, and activist. He was the most widely known writer and performer of reggae, and more specifically roots reggae. He is famous for popularising the genre outside of Jamaica and the Caribbean. Much of his music dealt with the struggles of the spiritually wealthy rasta and/or spiritually powerful Jah Rastafari.  Bob Marley was a member of this Rastafari movement, whose culture was a key element in the development of reggae. Bob Marley became the leading proponent of the Rastafari, taking their music out of socially deprived areas of Jamaica and onto the international music scene. Now considered a Rasta prophet, Marleys adoption of the characteristic Rastafarian dreadlocks and famous use of marijuana as a sacred sacrament in the late sixties were an integral part of his persona. He is said to have entered every performance proclaiming the divinity of Jah Rastafari. A few months before his death, Marley was baptised into the Ethiopian Orthodox Church and took the name Berhane Selassie (meaning the Light of the Holy Trinity in Amharic). His best known crossover songs are a mixture of reggae, rock, and rhythm and blues, which include I Shot the Sheriff, No Woman No Cry, Exodus, Could You Be Loved, Jamming, and Redemption Song. His posthumous album Legend (1984) became the best-selling reggae album ever, with sales of more than 12 million copies."}],
    "Buddha Bomb": [{"bio":"Brewing from the depths of the Southern California Inland Empire underground, Buddha Bomb is a musical entity ready to rock any scene, stage, or stereo! Buddha Bomb fuses the sounds of up-beat, feel-good ska and head-banging rock with a wailin horn section, ripping guitars, and intense female vocals.  Buddha Bomb formed in the summer of 2005, starting out as local musicians and friends with a common love for the musical community. Since that summer Buddha Bomb has gone on to play venues all over the California, Arizona, and Nevada, sharing the stage with Reel Big Fish, The Toasters, Buck-O-Nine, British ska legends Bad Manners, and local Riverside heroes like The Skeletones, The Voodoo Glow Skulls, The Debonaires, The Aggrolites, and Freakdaddy"}] ,
    "Buju Banton": [{"bio":"Buju Banton (born Mark Myrie 1973) is a Jamaican dancehall, ragga, and reggae singer. He was born in a slum near Kingston, Jamaica called Salt Lane. Buju is a nickname which is of Breadfruit. The name is ironic in light of Mark Myries slim frame and large head, but it is, nevertheless, the nickname his mother gave him as a child. Banton is a Jamaican word referring to someone with a superior attitude and a gift with speech, but it was also the name of a local artist Burro Banton that Buju admired as a child. It was Burros rough gravelly vocals that Buju emulated and ultimately made his own. Bujus mother was a higgler, or street vendor while his father worked as a labourer at a tile factory. He was one of fifteen children born into a family which was directly descended from the Maroons, a group of escaped slaves who proudly fought off the British colonialists. As a youngster, Buju would often watch his favourite artists perform at outdoor shows and local dancehalls. At the tender age of 13 he picked up the microphone for himself and began toasting under the monicker of Gargamel. His first single, The Ruler was released not long afterwards in 1987 under the production of Robert French at Penthouse Studios. In 1991, Buju joined Donovan Germains Penthouse Label and began a fruitful partnership with producer Dave Kelly. Buju is one of the most popular musicians in Jamaican history, having burst onto the charts there suddenly in 1992, with Bogle and Love Me Browning/Love Black Woman, both massive hits in Jamaica. Controversy erupted over Love Me Browning which spoke of Bantons preference for light-skinned women: Mi love mi car mi love mi house mi love mi money and ting, but most of all mi love mi browning. Some accused Banton of promoting a colonialist attitude and denigrating the beauty of black women."}] ,
    "Bunny Wailer": [{"bio":"Bunny Wailer, also known as Bunny Livingston (born April 10, 1947), was an original member of reggae group The Wailers along with Bob Marley and Peter Tosh. Bunny Wailer, a singer songwriter and percussionist, was born Neville ORiley Livingston on April 10, 1947 in Jamaica. Bunny Wailer and Peter Tosh continued recording as the Wailers during the period of time that Marley was in Delaware.  Bunny Wailer toured with the Wailers in England and the United States, but soon became reluctant to leave Jamaica. He and Tosh became more marginalized in the group as the Wailers became an international success, and attention was increasingly focused on Marley. Bunny Wailer and Peter Tosh subsequently left the Wailers to pursue solo careers. They were replaced by the I Threes, a move to broaden the base of success for the Wailers in the non-Jamaican market. After leaving the Wailers, Bunny became more focused on his spiritual faith. He identified with the Rastafari movement, as did the other Wailers. He self-produced a number of his recordings after striking out on his own. He has also written much of his own material as well as re-recording a number of cuts from the Wailers catalogue. Bunny Wailer has recorded primarily in the roots style, in keeping with his often political and spiritual messages."}] ,
    "Cam Randall": [{"bio":"No bio available"}] ,
    "Casino Madrid": [{"bio":"Casino Madrid is a post-hardcore band from San Diego, California, United States. Casino Madrid is the latest band to join the Artery Recordings roster, the joint venture between The Artery Foundation and Razor & Tie. The San Diego band is the ninth addition to the Artery Recordings family. We couldnt be more excited to join the Artery Recordings family, Demaio said. We felt as a band that this label was the best fit for us, not only because of its reputable name in the industry, but because of the family oriented attitude everyone at Artery presents to their bands. Were very pleased to welcome Casino Madrid to the Artery Recordings family. Weve had our eye on the band for quite some time and theyve been making waves in San Diego that are undeniable, said Eric Rushing, CEO of The Artery Foundation. The guys have an amazing batch of new songs that we cant wait to get out to everyone! Comprised of Joe Demaio (vocals), Marcelo Sedano (guitar/vocals), Armani Sanchez (guitar), Travis Knutz (bass), Rob Cesena (keys/synth/programming) and Johnny Thunder (drums), Casino Madrid formed in 2007. In 2009, the band released their self-produced EP, For Kings and Queens, which has sold over 20,000 digital tracks"}] ,
    "Castle Pines": [{"bio":"When you think of the name Castle Pines, you wouldnt think of some tree-hugging, snake wrestling, flip-flop wearing, thugged out dudes sitting in a cramped apartment space writing hits about being crushed by the harsh realities of life, would you? That is Castle Pines; an ultra-diverse group of individuals based out of Corona, CA. Castle Pines shares a long history in the Corona music scene and is proud of it. Named after a street in their hometown, Castle Pines explain themselves as, Individuals that fell through the cracks of suburbiaÉIt was through struggle and friendship that Castle Pines came to be. Originated by singer, Leandro Barrientos and drummer Sterling Fairfield, they began playing small coffee shops in the Inland Empire as an acoustic act. They then found groove-man Jesse Briseno to play bass. And through much effort, CP became complete with the addition of Leandros brother, Nick Barrientos on lead guitar.Within a year, Castle Pines was at the forefront of the IE music scene being recognized for their efforts by other bands, fans, and local press. With hit songs like Im A Volcano and I Saw You On The Radio, its easy for the crowd to sing a long at shows. Their style on stage is almost comparable to the grunge scene of the early 90s. Passionate, angry, and loving at the same time. CP has been working hard on crafting their favourite songs for the better half of the year and have finally finished their debut EP titled, Bless This House. They released their single, Strange Disappearance on Tuesday, August 28th for free on multiple music streaming sites. The song is full of fat Motown bass groove with punchy RATM-esque drums layered by lyrics and guitar that are comparable to a clash of Kings of Leon and Arcade Fire. Castle Pines seems to know what they are doing and are very happy to be where they are. What we do is bigger than us, says singer, Leandro. He describes CPs music live as a mutual feeling between the band and the audience, Éits a way of releasing your angst."}] ,
    "Chaplins Ashore": [{"bio":"Chaplins Ashore was formed on January 25 of 2005, composed of key members of other local so-cal bands. Chaplins Ashore is a punk/indie outfit from Southern California, our goal is to get our music out to the world by constantly touring and networking with fans, musicians, and anyone with an open ear. With a scene full of soda, Chaplins Ashore is the fresh drink of water youve been looking for. Chaplins Ashore will play anywhere and any place"}] ,
    "Collie Buddz": [{"bio":"Collie Buddz (born Colin Harper, 1982 in New Orleans, Louisiana) is a reggae/dancehall artist who grew up in Bermuda. Collie Buddz openly represents Bermy in his music and has an innovative style that has been compared to Gentleman and Sean Paul. Singles include Come Around, Mamacita, Ring The Alarm Remix with Beyoncé, Tell Me with Lil Flip, and Come Around Remix featuring Busta Rhymes.  In 2006 Collie Buddz signed with Sony BMG. He is also a part of Harper Digital. He declined a contract from Interscope. His first album will be released in late May 2007. Collie Buddz employs a style that is strongly rooted in 1990s era conscious and dancehall style reggae, using beats and vocal techniques reminiscent of the iconic stars of that day - including Sizzla, Buju Banton, Bounty Killer and Beenie Man. The singer has attributed the defining influences on his music to lyrical clashes (such as those between Beenie Man and Bounty Killer) and dubplates, particularly those of Kilimanjaro, that were core to the sound clash culture of the 90s.  Buddz is an avid fan of Buju Banton and cites that artists Mr. Mention has one of his favorite albums."}] ,
    "Conversation Kills": [{"bio":"We are a fast, 4 piece, punk rock band with members from Los Angeles and Colton CA. We are dedicated to keeping punk rock alive and making sure the scene never dies. Conversation Kills was established in 2007 . The band since then has gone through different line ups through out the years but has always remained to stay the course and deliver fast, melodic and aggressive music."}] ,
    "Counterpoint Culture": [{"bio":"Counterpoint Culture is the new jam. Our songs were developed through mad science and relentless sound experimentation with Cameron Pappas, Andrew Krause, Carlson Miller and Dylan Streshly. San Diego is our homebase and music is our life."}] ,
    "Curtiss King": [{"bio":"In this microwave era of Hip Hop music where materialism, misogyny, and half baked compositions flood the airways, somehow Dwan Howard has emerged on the scene as an irresistible and well prepared home cooked meal. Better known by his stage name Curtiss King, the son of an author/pianist mom, he has managed to make a respectable name for himself in southern California by consistently goings against the grain as an emcee and producer. Growing up a very shy young man, particularly when attending Curtiss Middle school, Curtiss found ways to conquer his insecurities by listening to music, writing poetry, and getting lost in 90s sitcoms, hence the name: CURTISS KING. Inspired by the freedom of Outkast, passion of 2pac, creativity of Kanye West, musicianship of Cameo, Zapp & Roger, Earth Wind and Fire, and the therapeutic nature of Sade, Jill Scott and Erykah Badu, he is anything but your typical independent artist. Originally from Carson and now residing and representing the Inland Empire, Curtiss King embodies the feel good, humorous and uplifting essence of the 90s mixed with a refreshingly raw and aggressive edge. Rapping since the age of 17 and producing since 18, he found out very early that without the proper funds and support he would have to be a jack of all trades to accomplish his goals. As a result Curtiss King taught himself how to produce, engineer, write his own records, edit his own music videos, design his own album covers, script his own websites, and build his brand from the ground up.  Powered by a rising Independent label Black Cloud Music and vintage clothing sponsor MOVintage, Curtiss King is quickly becoming a force to be reckon with."}] ,
    "Damien Marley": [{"bio":"Damian Robert Nesta Jr. Gong Marley (born July 21, 1978) is a reggae artist who has won three Grammy awards. Damian Marley is the youngest son of reggae legend Bob Marley. Damian was two years old when his father Bob died; he is the only child born to Marley and Cindy Breakspeare, Miss World 1976. Damians nickname Junior Gong is derived from his fathers nickname of Tuff Gong. Damian has been performing since the age of 13. He shares, along with most of his family, a full-time career in music. Unlike his brothers and sisters, however, his musical specialty is toasting, a Jamaican vocal technique that is a predecessor to rapping.  Damian has 3 records to date, including the highest placed reggae album in the USA billboard album charts with Welcome to Jamrock, and the highest place reggae song in the UK Top 40 with Welcome to Jamrock. Like his father before him and the rest of the Marley family, he is a Rastafarian and his music reflects the Rastafari guiding principles of love and political freedom."}] ,
    "Daniel Chavez": [{"bio":"Hello! My name is Daniel. I enjoy playing the guitar along with singing. I write my own songs as well as do covers. Acoustic music is my main focus, but I love many other genres as well. Thank you so much for your support. I plan to post up new songs soon and I hope you enjoy them! Take care!"}] ,
    "David Clerest": [{"bio":"David Clerest was born in a musical family. He Played drums since childhood and got his first drum kit at age 4. He picked up the guitar at age 13. After much struggle to keep a 3 piece band together during the 80s, he decided to combine his talents as a drummer, guitarist, bass player and singer to start his own music project.  David programs the drums, and records the bass guitar, to use as back up tracks. On stage he plays both rhythm, and lead guitars and vocals. Dedicated to the raw sound of hard Rock and Metal, he delivers a genuinely LIVE show by minimizing overdubs and maintaining the driving force of Metal riffs on his guitar."}] ,
    "Decisions": [{"bio":"Decision is an up coming artist who prides himself on giving you a new outlook on the same and redundant Rap and HipHop Genre. Currently Uploading videos every Mon/Wed/Fri. Subscribe for new music, covers, remixes, freestyles, and more."}] ,
    "Derrick Sanderlin": [{"bio":"Once in a Christian metal band located in the middle of no where, Derrick felt a draw and a more intimate expression of his heart deep in the confines of experimental acoustic music. With mixed up influences such as Aaron Goldberg, Jason Mraz, Blind Pilot, Bon Iver, The Chariot, and a drive to worship God, he may not be the most comfortable to some. But listen closely, and you will see a rebel, a bleeding heart, and a guy who cares about others. Please enjoy the ever progressing procedure that is Major Heart Surgery."}] ,
    "Divide The Day": [{"bio":"The Southern California quintet plays uncompromising hard rock with just the right mix of Sunset Strip attitude and cowboy swagger. Their forthcoming Universal Republic offering is an explosive concoction of riffs, hooks, grooves and gusto. On songs like the bands breakout single, One Night Stand, Joe croons with incendiary passion, while guitarists Maude and Adam fire off smoking hot riffs and tasty leads. Its all driven forward by the freight train rhythm section of Brian behind the kit and Billy on bass. Divide the Day have got the spark to light up an arena, and their sexy brand of hard rock is guaranteed to make asses shake.  Joe describes the bands sound best. Its western rock, he says. We make music for cruising on your motorcycle or hanging at the bar. Its American, and its real. Divide the Day officially began in 2001 where Joe and Billy bonded over a love for music, alcohol and women. In 2005, they signed a deal with Pluto Recordings and released their independent debut, Pretty Girls With Ugly Boys. At that point, theyd cultivated a large and faithful local following, playing anywhere and everywhere there was a stage.  2007 came, and the band hooked up with Maude, Brian and Adam rounding out the current lineup wherein Divide the Day was born. They entered the studio with Fred Archambault to record Deadly Like the Snake. The self-released album hit the streets in 2008 to much fan ardor, and it also caught the attention of Universal Republic, which became the bands home later that year."}] ,
    "DJ Mike": [{"bio":"No bio avalible"}],
    "Dominic Balli": [{"bio":"Stepping onto the music scene nearly six years ago, reggae-infused pop/rock artist Dominic Balli hails from Oxnard, Calif. With influences ranging from Stevie Wonder to Bob Marley to Lauryn Hill, Ballis music is a combination of soulful melodies, gripping lyrics, and make you move grooves. His first independent release, Public Announcement (2008), sold more than 20,000 copies, landing Ballis debut effort among iTunes Top 30 Reggae Albums in 2008 and 2009. The project additionally produced a Top 30 Christian Hit Radio single with All We Need Is Love in 2010, while affording Balli the opportunity to perform alongside such top artists as Natasha Beddingfield, Jazon Mraz, Ziggy Marley, Hawk Nelson, Lecrae, Phil Wickham, and Toby Mac."}] ,
    "Dose of Adolescence ": [{"bio":"Timmy Brown, Stephen Patrick Madigan and Jimmy Brown formed Dose of Adolescence in 1999. What originally started out as something to do for fun to play in front of their friends quickly became something they wanted to dedicate their lives to. On Sept 3, 2006, they lost Stephen to a tragic alcohol-related accident. Since that day, Dose has committed their lives to making sure that Stephens legacy lives on and see to it that they make his dream a reality. After 11 years of trials, triumphs, and tribulation, Dose has, and is continuing to make their mark on the world. Aside from their tremendous talent, Dose has an infinite amount of heart, which is what they pride themselves on.  Dose of Adolescence plays an active role in raising awareness and money for The Gavin R. Stevens Foundation and H.A.N.D.S. On International. Dose is constantly giving to those in need. Their ever growing Love Not Money movement has been the most contagious spread of acts of kindness and this consistently shines through in their music."}] ,
    "Drunken Poetry": [{"bio":"No bio avaliable"}] ,
    "Duane Stephenson": [{"bio":"Duane Stephenson is more than just a reggae singer.  His work exhibits  the versatility of many of musics greatest artists in the pop realm;  mixing poetic lyrics that address social ills, romance and global issues with excellent phrasing, potent hooks and melodic changes -  all delivered in an extremely nimble tenor that wakes the soul and challenges the mind. Duane Stephensons work as a songwriter reflects contributions from a diverse group of industry veterans including a collaboration on Better Tomorrow with Jamaican mega-producer Handel Tucker creator of hits for Maxi Priest, Diana King, Shaggy and The Fugees.  Better Tomorrow is an uplifting ballad with world music influences and an optimistic message.  An accompanying video was directed by Ras Kassa the Guru director of Damian Marleys Welcome To Jamrock and other innovative videos with Sean Paul, Richie Spice and Tarrus Riley.  The Better Tomorrow video features uplifting scenes of people striving to overcome obstacles and a sincere message of encouragement to those in the artistic community with scenes that include a ballet dancer,  as well as varied musicians including a full string section.  Duanes current album BLACK GOLD released on VP Records, is nominated for the 2010 Album of the Year at Jamaicas EME (Excellence in Music & Entertainment) Awards.  Rescue Me the initial single from the BLACK GOLD album has maintained a top three chart position for several weeks, reaching #1 and the BLACK GOLD album has reached #1 on the Jamaica Music Countdown.   These songs are written with originality and profound intention as Duane explains,  When we do an album, we do music that people can relate to because any situation you find yourself in, chances are someone else has found themselves in that situation.  It is real life situations, so the real life emotions come out, that is how it is. Duane wrote A Step for Mankind  with The Wailers to benefit the United Nations World Food Programme.  The track has become the anthem for global hunger eradication. The song is featured on Oniric Records Solutions for Dreamers: Season 3 which directly benefits the WFP, the song is most importantly a call to action for everyone to stand up against hunger and truly help mankind take a step in the right direction.  Duane was introduced to the Wailers through their work with the UN World Food Programme. In October, 2010 Duane was invited by the World Food Programme to honor Secretary of State Hillary Clinton at the The George McGovern Leadership Award Ceremony as part of his work to raise awareness on the need for more action in addressing the issue of world hunger.  As for the scope of his contribution as a reggae artist and humanitarian, he explains: What I am doing is part of a larger mandate. The more you can do to make the world a better place for everybody, it is really a pleasure to do the little bit that I am actually doing, the feeling is great.   In the fall of 2010, Duane teamed up with The Wailers, led by Aston Family Man Barrett  performing as a special guest on tours throughout  North and South America. in Brazil he shared equal billing with Ky-mani Marley, Big Mountain, Pato Banton and The Wailers for the  One Life Tour. Recent shows have garnered a positive response with sold out performances for this compelling songwriter and versatile singer.   Festival performances in 2011 include the Rotterdam Reggae Festival in The Netherlands, Rockers Rockers Rockers in France, Sierra Nevada World Music Festival in the United States. Duane Stephensons second single from the BLACK GOLD release, Sufferers Heights features vivid lyrical images in sung with conviction, backed by lush female harmonies, and punctuated by intricate horn lines.  Through these lyrics, Duane reminds the listener that although we may have financial concerns, there is a profound lack in the worlds under-served, sufferer communities, with the refrain, things could be better, things could be worse….In a sufferers heights, the youths cant find no dinner, and pure old clothes they dress up inna. His debut recording, FROM AUGUST TOWN released on Cannon/VP Records and produced by reggae maestro and saxophonist Dean Fraser was heralded by Billboard magazine as one of six albums, collectively galvanizing a roots reggae revival with lyrics that convey romantic longings and the anguish of ghetto realities with equal conviction.   Pitchfork.com cited the album as undoubtedly a highlight of not just 2008, but perhaps the past few years. His new albums title  BLACK GOLD has its metaphorical roots in several areas, including the representation of self-worth as a black person, and by extension Africa, as Duane explains, BLACK GOLD is also oil and we see how precious it is and how much abuse goes on to obtain it; people are suffering and yet we are spending millions on guns, bombs; instead of buying steel to make a house you buy it to make a gun.  The song and album title also speak to the value of our music, because it is black gold.  As Duane reflects on the songwriting process for his second album, he notes, I started to travel, meet new people and have new experiences; there is so much growth mentally, emotionally, and musically, I tried to encompass that growth into the songs on BLACK GOLD.  And as for the messaging on the album he explains, A record must have a purpose, and my ultimate purpose is to speak about what is happening but to ultimately leave people with hope. Collaborations on BLACK GOLD abound with some of reggaes most innovative lyricists and such as dub poet Mutabaruka who speaks truth to power on the acoustic track, Truth Is or sparring for a womans affection with Gramps Morgan on the country music-influenced, Rescue Me or addressing issues facing Jamaicas young girls with the outspoken Queen Ifrica recording the cover of Dennis Browns  Stay at Home."}] ,
    "Exact Opposites": [{"bio":"Exact Opposites is a collective of musical talent drawn together to create quality music with a unique style. The band currently consists of Daddy Fat Strings (bassist), Jae Rawkwell (turntablist), Meccanism (vocalist & drummer), and I.Fit.The.Description (vocalist). Distinguished by an inarguable stage presence and a sole sound, Exact Opposites make an intention to produce positive, boundless music. Commenting on E.Os mixtape, The Amazing Adventures of Quick Draw McGraw & Huckleberry Hound, Blackmilk of Soulified.com comments, The more I listen to it the more it gets reminiscent of a classic Wu Tang album with a west coast twist.. E.O. have firmly planted their foundation in todays music scene by opening up for Blackalicious at the Key Club in Hollywood to performing at the legendary Whiskey A Go Go and each show in between with names like Del Tha Funkee Homosapien, Planet Asia, The People Under the Stairs, Yelawolf, and the late GURU of Gang Staar."}] ,
    "Finess The Great": [{"bio":"Underpaid, Underrated, Understatement. Mucho Necesario 1000. The Dean of Base Rock Academy"}] ,
    "Flow Ethics": [{"bio":"No bio available"}] ,
    "Four On The Floor": [{"bio":"No bio available"}] ,
    "Fresh": [{"bio":"No bio available"}] ,
    "Genre": [{"bio":"No bio available"}] ,
    "George Jauss": [{"bio":"Singer/songwriter George Jauss is 29 years old. He started playing guitar at the age of ten and he wrote his first song at thirteen. He loves to have fun with his audience. George was born in southern Germany in the city of Heidelberg. This city is very old and known for the world famous castle named after the city. It is located on the Neckar River directly in front of the University Of Heidelberg where Mozart studied. Georges father was a sergeant in the U.S. Army stationed In Germany at that time. Later he was transferred to Fort Irwin California. George was raised in the High Desert area of southern California. George is blessed with the talent of playing the guitar, piano, bass, drums. His influences are many, but Tom Petty and Bob Marley are two of his major influences as a singer/songwriter. George has been in a number of bands and has opened for bands such as Great White in 2000. Now on his own he strives to widen his audience with his style of music. While being California based he wants to take his music to the world. Running Free is Georges best work to date. George has been working with legendary producer/engineer Keith Taylor(Johnny Cash, Pink Floyd, Eric Clapton) for the last 5 years. George is currently writing for his next album. If everything goes as planed recording sessions should start sometime in 2010! This is my life man! Its what I breathe every day, and its what I was put here to do."}] ,
    "George Jauss and The Messenjahs": [{"bio":"Singer/songwriter George Jauss is 29 years old. He started playing guitar at the age of ten and he wrote his first song at thirteen. He loves to have fun with his audience. George was born in southern Germany in the city of Heidelberg. This city is very old and known for the world famous castle named after the city. It is located on the Neckar River directly in front of the University Of Heidelberg where Mozart studied. Georges father was a sergeant in the U.S. Army stationed In Germany at that time. Later he was transferred to Fort Irwin California. George was raised in the High Desert area of southern California. George is blessed with the talent of playing the guitar, piano, bass, drums. His influences are many, but Tom Petty and Bob Marley are two of his major influences as a singer/songwriter. George has been in a number of bands and has opened for bands such as Great White in 2000. Now on his own he strives to widen his audience with his style of music. While being California based he wants to take his music to the world. Running Free is Georges best work to date. George has been working with legendary producer/engineer Keith Taylor(Johnny Cash, Pink Floyd, Eric Clapton) for the last 5 years. George is currently writing for his next album. If everything goes as planed recording sessions should start sometime in 2010! This is my life man! Its what I breathe every day, and it s what I was put here to do"}] ,
    "Ghetto Genius": [{"bio":"On June 18, 1989, Daniel Macias was born in La Puente, CA. Growing up through many years of adversity, Ghetto Genius found a niche in the music community. He always had a passion for music, and would find himself memorizing tunes, tones, and various notes even as a young child. Around the age of 15, he began to follow hip-hop with a passion, listening to such artists as 2Pac, Eminem, The Game, Ice Cube, and various others. After watching Ems movie, 8 Mile, he felt inspired and inclined to try music out for himself. A week after taking this decision, Ghetto Genius hopped into his first rap battle with a group of people that hung around his high school, and despite not knowing how to rap as well as the others, he found even more inspiration in his apparent defeat. The knowledge he gained from that encounter would help him grow even further as a music artist, as years passed by and he honed his lyrical skills even further, under his first pen name Xplicit. He did a few tracks with his partner in crime, Painer, under their first guise of a crew called Kaotic Thugz. After a few more years of experience, as well as new friends and skills acquired, Ghetto Genius founded Wiseguyz with the consent of his fellow members Psyonik and Painer, which grew to the movement of WiseGuy Nation. Ghetto Genius has performed on stage, and was signed to Innertec Records in January of 2011, only to be released from contract in November of the same year. He is now an independent artist, working in collaboration with producers such as Tone from Damn Criminal Productions, and Kritical of StreetLight Music. WiseGuyz, a crew that started out small, had slowly begun to take shape under the vision of Ghetto Genius and the rest of the family, which had inducted Lance London and DJ 4Play as the final members of the WiseGuy Nation. Ghetto Genius has his own edgy style that pushes the limits of hip-hop and expands past the imagination of many. He is the new standard for the industry, and is set to be a major contender in the near future"}] ,
    "Good Creation": [{"bio":"Good Creation formed in the late Spring of 2009 at La Sierra University, a small college in Southern California. They then got their start performing in the mountain resort town of Big Bear, playing for the city, sporting events, restaurants and bars. This trios members represent the West Coast and its diversity, with Gabriel Orozco (singer/guitarist) from Portland, Oregon, Jordan Speyer (drums) from Santa Cruz, California, and Daniel Olmedo (bass) from San Diego, California. Good Creations mixes pop melodies and choruses with Roots/Reggae rhythms, and has been a hit with kids, teens, college students, adults, and elders. Whether it be for your: -Venue/Club -Bar/Restaurant -Youth Group/Church -Corporate/Business Event -Sporting Event -Charity Event -House Party Good Creation is the fun and chill way to go!"}] ,
    "Green Asians And Ham": [{"bio":"No bio available"}] ,
    "Groundation": [{"bio":"Groundation is a Fusion-Reggae band based in Sonoma County, California. It was established in 1998 by Harrison Stafford, Ryan Newman and Marcus Urani upon their meeting at the Jazz program at Sonoma State University. Groundations music incorporates the lyrical struggle of Roots Reggae, the progressive musicianship of Funk/Jazz fusion, and other-worldly transcendental Dub. The 9-piece band creates an altogether new Reggae sound, featuring swirling horns, stout poly-rhythmics, and soulful harmony vocals. Their concerts utilize live improvisation, in classic jazz fashion, and are renowned for their high energy, communion-type atmosphere. Groundation comes from the Rasta term Grounation. Grounations were gatherings based on using music to attain common vibration, with the focus on manifesting positive energy to affect social change. Having toured in over 30 countries on 4 continents, Groundation has truly become a world-wide movement and is the biggest American Reggae band touring the world today…come and find out why."}] ,
    "Gyptian": [{"bio":"Windel Beneto Edwards a.k.a. Gyptian was born on October 25th 1983, and grew up in King Weston a Rural District, in St. Andrew. He lived with both his parents, his father a Rastafarian and his mother a Seventh Day Adventist Christian (who he explained was the disciplinarian of the family). Gyptian, was at first hesitant and uncertain but eventually he became serious about being a vocal artist professionally, and Mr. Wong took him under his wings, where he was groomed and eventually he transformed into Gyptian a name given to him by Mr. Wong, Richie Bang and others from the studio, due to his habit of tying a shirt around his head and twisting his chin hair like an Egyptian Pharaoh."}] ,
    "Hammers and Hearts": [{"bio":"No bio avaliable"}] ,
    "Hide The Details": [{"bio":"Hide the Details is a Pop Punk band with its roots firmly planted in the hardcore and punk scene,founded in The summer of 2010 by Brandon Mericle, Brett Blower ,and Freddy Bates. During this time the Band was known as Shores After recording some demo songs the band underwent a name change and hit the studio in the fall to record there Debut ep Waves which Was released in late november. Hide The Details is currently in the studio recording a full length entitled recession"}] ,
    "Hired Guns": [{"bio":"We got together right before the world ended and saved humanity soul with Rockn Roll and gained control. We are the authority and the anti-fear that results from a upside down republic. ignorance is bliss so be thankful that i kept this short."}] ,
    "Hit The Switch": [{"bio":"One day not long ago, there was a storm that changed the entire galaxy...The sky grew dark grey with cracks of white, thunder shook the rain from the clouds, lightning struck the earth with such great force, that planet earth broke from its orbit and crashed into Mars, creating the astroid belt. It was at this moment that the Gods created music to calm the galactic storm, it sounded something like Coldplay, or maybe Dave Matthews... Anyway, 5 billion years later, these random four schmucks came together to make music that would invoke the return of the once great, galactic storm."}] ,
    "Hitpoints": [{"bio":"Shaped by pop, electronic sounds, elements, and soundscapes, HITPOINTS was formed in 2010 in Los Angeles, California and birthed from a collection of songs compiled by lead singer Phil Danyew. Greatly influenced by artists such as Coldplay, Radiohead, Jon Hopkins, Imogen Heap, Bjork, and Paper Route, HITPOINTS is an original amalgam of musical inspiration and talent."}] ,
    "Holding On to Sound": [{"bio":"No bio avaliable"}] ,
    "Hour 11": [{"bio":"Formed in 2011 in Orange County California, Hour Eleven is a Metal band in the general range of the Seether, Sevendust, Stone Sour, and Korn. It consists of four members: Dan Daniels (Vocals, Guitars), Sean Silas (Guitars, Vocals), Marcus Santos (Bass) and Jay Smith (Drums). Since joining together and recording their debut EP All it Was a Memory, Hour Eleven and have sold over 3,000 units out of the trunks of their cars, via their website and live performances, (club and college) throughout the United States. The groups fan-base consists of over 5,000 fans strong; 500 of theses fans being active street team members that distribute flyers, stickers and CD samplers at similar shows.  In the spring of 2012, Hour: 11s EP charted in the top 50 for 6 consecutive months on the Reverbnation Rock Top 200 charts."}] ,
    "Hyla Brook": [{"bio":"Hailing from Redlands, California, Hyla Brook is a rock band with only one goal: to write great music that anyone can enjoy. Not bound by any genre label or musical style, Hyla Brook fuses multiple styles together to write powerful, infectious songs that reach out to the heart and soul. Although still a relatively new band on the scene, Hyla Brook has already created quite a local buzz. Playing as often as they can, they have built a respectable following and pack shows wherever they go. Their 2010 self-titled EP has received outstanding reviews and continues to amaze new listeners."}] ,
    "Idasas": [{"bio":"For many, rock-n-roll may be a bitter, angry thing. But for the members of Idasas, rock-n-roll is about having fun. And this is the band to bring the fun and excitement back to music. In a spirit of living life to the fullest, Idasas brings an irrepressible spirit to the world of rock, jamming out and treating listeners to the kind of music that reminds us what lifes all about. We want to put the fun back into rock. Anger, depression and the ‘emo mindset have run their course and were here to bring the party back to music.  Music is exciting, says Idasas. Rock is fun. It makes us feel happy, driven, energetic, accomplished, excited and happy. Especially if its the music of Idasas. These guys cant be stopped. Theres no brakes on the train of sheer fun and joy represented by the vibrant songs of Idasas. Without music, says Idasas, the world would be a much quieter place. If there was no music, what would we have sex to? You might get a lot of lofty ideals cited as influences by many bands. The folks in Idasas can give you a much more down-to-earth, straightforward reply. Girls. Isnt that why were in a band? Seriously, though, were inspired by life, love and laughter. All the experiences that make us who we are. Life is for enjoying and Idasas enjoys its rock-n-roll. And the audience enjoys Idasas rock-n-roll.  Idasas has opened for Sugarcult and was the main stage opening act for 10 Years at 2006s Orange Blossom Festival. Writing is incessant, says Idasas. When not creating new music, the bands busy touting its new release, the debut New Future, which is the perfect name for a band such as this whose star is on the ascent."}] ,
     "India": [{"bio":"India is a 4 piece modern indie rock band hailing from the city of Redlands in Southern California. Formed in the Winter of 2011, shortly after India released several live recordings in early and mid 2012. In Mid October of 2012 India headed into the studio to record their first EP due to be released early 2013. Even though being together for just shy of a year, India has quickly found a chemistry that has aided their way through the sea of Metal bands that is the inland empire. Indias live sets have been described as intimate, sincere, and full of an energetic atmosphere that is refreshingly different."}] ,
    "Indian School": [{"bio":"Indian School is an energetic, feel good, driving to the beach on a sunny day kind of band. They sound almost like The Strokes with the instuments they have in a bnd. Their indie pop rock appeling sound makes you want to listen to the whole album because every song is different, yet the same style. Original sound, quality and lyrics. "}] ,
    "Inverse": [{"bio":"Inverse is a six-piece Modern Rock band from Southern California, which seamlessly melds Classic Rock, Delta Blues and Pop aggression. Using its danceable sound and high-energy live show as a foundation for expression in art, fashion and what it means to enjoy the nightlife, Inverses six members come together to create something entirely new, and infinitely memorable. Currently, Inverse is recording and working with producer/mixer Mark Needham (Neon Trees, The Killers, Fleetwood Mac) for M.A.N Production. Recently, two singles Do You Wanna and All American have been gaining momentum on many southern California radio stations. Additionally, the band regularly self books its own Western U.S. tours and has recently shared the stage with such bands as Angels and Airwaves, Unwritten Law, Finch, The Damned Things, (hed) Pe, Alien Ant Farm and many others. With Inverse packing out shows at Hollywoods Viper Room and being regularly asked to play industry parties, DVD releases and special events, the groundswell of demand is only growing for these So-Cal lads, one raucous party at a time."}] ,
    "Irie Love": [{"bio":"IRIE LOVE began singing at age nine. She was given the name Irie by her father, an avid reggae fan and Love is her mothers family name. She grew up in Hawaii in a small town called Kailua on the island of Oahu, where Irie was encouraged by her mother to sing solos at the family church. Her six foot-tall stature and natural beauty brought numerous opportunities for both runway and print modeling work as well."}] ,
    "Israel Vibration": [{"bio":"Israel Vibration is a reggae harmony trio, originating from Kingston, Jamaica. Lascelle Wiss Bulgin, Albert Apple Gabriel Craig, and Cecil Skeleton Spence all overcame adversity in the form of childhood polio and went on to be one of the most successful roots groups to form in Jamaica in the late 1970s. The trio initially met at a rehabilitation center. After going their separate ways, and each converting to the Rastafari movement, they reunited in Kingston and formed a vocal group. Funding for their first album came in the form of a grant from the Twelve Tribes of Israel branch of Rastafari after Hugh Booth, a member of the Twelve Tribes, had overheard the three men singing in a wooded area outside Kingston. Apple and Wiss were living in the area, which they had converted into a home. Israel Vibration recorded three albums; The Same Song, Unconquered People, and Why You So Craven before temporarily disbanding in 1981 after recording sessions for the latter were left incomplete. The three men moved to the United States to seek professional health care and escape the growing Dancehall movement in Jamaica. In 1988, Gary Dr. Dread Himmelfarb, founder of RAS Records, urged the trio to reunite and record an album. Skelly, Apple, and Wiss were flown to Washington, D.C. to record a new album at Lion and Fox Recording Studios."}]  ,
    "Jamelody": [{"bio":"Michael JaMelody Williams was born in Carenage, Trinidad & Tobago in 1980. The last of six children, it was not long before his parents and older siblings realized that he was a very gifted vocalist and musician. As a member of this very spiritual family it was almost destined that young Michael would be part of the church choir. There, he expanded his vocal ability while embracing his religion. As a teenager he started to apply his vocal skills to making reggae compositions with sweet melodies and hooks in a style very characteristic of the R&B he had been singing earlier in his life but with rich cultural and spiritual content. This is why he took the name JaMelody (Jah Melody) It was at a captivating performance as an opening act for a reggae show in Port of Spain which brought him to the attention of his current manager who immediately took him to Jamaica to begin recording. On a second trip to Jamaica he was introduced to Bobby Digital Dixon, ace producer and owner of the well known record label Digital-B. The sweet sound of Jamelody is a result of their amazing collaborative effort and musical chemistry"}] ,
    "Jimmy Cliff": [{"bio":"Jimmy Cliff OM ( Jamaican Order of Merit) born as James Chambers (1 April 1948, St. Catherine, Jamaica) is a Jamaican reggae musician. He is best known among mainstream audiences for songs like Sittin in Limbo, You Can Get It If You Really Want, Many Rivers to Cross and the title track from The Harder They Come, a film soundtrack which helped popularise reggae across the world.  Cliff moved to Kingston in 1962. After he released two singles that failed to make much of an impression, his career took off when his Hurricane Hattie became a hit, while he was aged just 14; it was produced by Leslie Kong, with whom Cliff would remain until Kongs death. Later local hit singles included King of Kings, Dearest Beverley and Pride and Passion. In 1964, Cliff was chosen as one of the Jamaican representatives at the Worlds Fair, and Cliff soon signed to Island Records and moved to Britain. Island initially (and unsuccessfully) tried to sell Cliff to the rock audience, but his career took off in the late 1960s. His international debut album was Hard Road to Travel, which received excellent reviews and included Waterfall, a Brazilian hit that won the International Song Festival. Waterfall was followed in 1969 by Wonderful World, Beautiful People and Vietnam in 1970, both popular throughout most of the world. Folk rock singer-songwriter Bob Dylan even called Vietnam the best protest song hed ever heard. Wonderful World included a cover of Cat Stevens Wild World, which was a success in 1970."}] ,
    "Jimmy Riley": [{"bio":"For the past three decades, audiences around the world and in his native Jamaica have been delighted with the poetic writings and melodic sounds of reggae artist Jimmy Riley. Known for his strong and splendid tenor voice, fans regard Jimmy Riley as one of the veterans and ambassadors of classic reggae music. He has traveled extensively through the world performing in countries such as Brazil and Japan, where he performed on that countrys first Reggae Sunsplash. In the USA Jimmy Riley has sold out venues while touring the East and West coasts, and has received rave reviews."}] ,
    "Joe Lawson": [{"bio":"No bio available"}] ,
    "Johnny B": [{"bio":"No bio avaliable"}] ,
    "Johnny Cheapo": [{"bio":"Johnny Cheapo hails from the streets of San Bernardino, California. There you will never find a more wretched hive of scum and villainy. Thus, a perfect atmosphere to conjure up true Rock n Roll mayhem . With his snotty, yet memorably catchy brand of punk rock , Cheapos music harkens back to the noise that made the Sex Pistols and Ramones household names. And his wild live shows are often accompanied by awed and inspired reactions from the crowd, who are often amazed that such soul and energy can still exist in this age of re-hashed rock n roll. Cheapo, who is furiously independent, also manages to release his own music on his own label called Smut Records. After two releases, Say Hello To Disaster (1999) and Rock N Roll Sinner (2002), his much over-due 3rd cd Misbehavin is due in the summer of 2006. Watch for Johnny Cheapo to take the punk scene by storm in the next year where he will tour the US and Europe in support of his latest release!"}] ,
    "Justin Hinds & The Dominoes": [{"bio":"Justin Hinds (May 7, 1942 - March 16, 2005) is best known as a Jamaican ska singer with his backing vocalists the Dominoes. He is best known for his work with Duke Reids Treasure Isle Records with his most notable song Carry Go Bring Come made in late 1963 and went to number one in Jamaica. He recorded 70 singles between 1964 and 1966 and was the most popular artist on the label.  He started his musical career singing in bars and on the beach in Ochos Rios. Hinds moved to Kingston, Jamaica where he became influenced by Rastafari. He was turned down by the Sir Coxsone label owned by Coxsone Dodd but signed with Treasure Isle Records. By this stage, the Dominoes consisting of Dennis Sinclair and Junior Dixon had become his backing vocalists. The singers are believed to have taken their name both from a love of Fats Domino and dominoes."}] ,
    "JutsMusic":[{"bio":"JutsMusic is a signed artist to MoeTan records, and is progressing to be one of the next big time artists. The music that JutsMusic plays is something different that cannot be directly compared to any mainstream American artists today. It is a mixture of Indie Rock, R and B, and Hip Hop, all played either on a ukulele, which is the main instrument, or a guitar, both with a band backing it up. It is mainstreamed based music that mixes the best of all worlds of Rock, R and B and Hip Hop. There is no specific genre to this type of music; therefore he labeled the genre, Coffee Shop Hip Hop, which will be the name of his first album, coming out soon. JutsMusic first started playing music at 13 years of age and then it progressed to start creating his own music, with his own kind of style. With the mixture of mainstream and live string instruments, he believes he has a sound which cannot be replicated by any other artist. The vision that he sees for his music is large, attracting every kind of pop music listener, because of its diversity."}],
    "Kara Aubrey": [{"bio":"Hi, Im Kara Aubrey named after a song. Thats, however, not why I write songs. Songwriting is a scratch pad for an enduring curiosity. I love to write, love to rock. Beyond a glitter-happy tendency, I am a deep-thinker. In a pensive moment, like gazing out of a window at a cotton-candy sunset, I want to savor the beauty, run outside, and capture a glimpse of the grandeur before the colors fade.  Moments like these make me inquisitive of each days opportunity, taken or denied, to be significant in a world spinning at 24,000 miles an hour."}] ,
    "Kenyauda LaNai": [{"bio":"My earliest years of life are rooted in Gary, IN. (my familys hometown) but it is in California where my passion for entertainment started at a dance academy when I was 7 years old.God has been so good to me in life & I am excited to see what He has in store for me next. I truly appreciate all of the love from all of you who support me..I know you dont have to yet you choose to do so anyway & that means so much to me. With all of my heart I appreciate & love you all sincerely! May God bless you double for how your love has blessed me. Jesus is love."}] ,
    "Kevin Martin": [{"bio":"No bio avaliable"}] ,
    "Knock Out": [{"bio":"Knock-Out is a Punk/Reggae band from the Riverside, California. They have played alongside many well known bands such as Guttermouth, Voodoo Glow Skulls, Sugarcult, plus many more. Knock-Out is known for being able to flip the fastest punk into the smoothest reggae grooves. There is a lot more to this band then just labeling it as punk or reggae. Being heavily influenced by ska, Hip Hop, rock, and many other genres also, definitely keeps things interesting when listening to this band. Knock-Out is always busy with shows and writing so check out the website for more info."}] ,
    "Konami Homi": [{"bio":"Born on March 25th, 1988 with intentions on taking over the world and has stuck with those intentions until present day. Futuristic Hip Hop Artist who came out of nowhere to save the worlds music from complete destruction. Coming into the game with a unique style and interesting story lines that keep you wanting more. With zero respect for quitters, ho's & horrible rappers Konami expects to conquer all...Can he do it?? you'll just have to wait and see Ladies and Gents."}] ,
    "KORA": [{"bio":"No bio avaliable"}] ,
    "Kris Sven": [{"bio":"No bio avaliable"}] ,
    "Late Night Reviv": [{"bio":"No bio avaliable"}] ,
    "lauryn hill and bob marley": [{"bio":"Lauryn Noel Hill (born May 26, 1975 in South Orange, New Jersey) is an American musical artist, and record producer, initially establishing her reputation as the most visible and vocal member of the Fugees, then continued on to a solo career releasing The Miseducation of Lauryn Hill. Hills works primarily in the neo-soul and alternative rap styles, among other influences from reggae and folk. After a four year hiatus, she released the controversial MTV Unplugged No. 2.0, a live recording of original material except for So Much Things to Say and The Conquering Lion. She soon denounced her fame and began writing more spiritually and socially conscious songs.Hill is noted as a humanitarian, and in 1996 she received an Essence Award for work which has included the 1996 founding of the Refugee Project, an outreach organization that supports a two-week overnight camp for at-risk youth, and for supporting well-building projects in Kenya and Uganda, as well as for staging a rap concert in Harlem to promote voter registration.In 1999s Grammy Awards, Hill was nominated eleven times and won Album of the Year (beating Madonnas critically acclaimed album Ray of Light), Best New Artist, Best Female R&B Vocal Performance, Best R&B Song, Best R&B Album, setting a new record for a female performer. Hill has four children with retired (American) football player Rohan Marley, son of the late reggae music icon, Bob Marley: Zion David Marley, born 1997, Selah Louise Marley, born 1998, and second son Joshua, born 2002. A fourth child, John, was born in 2003 and the couple married soon after."}] ,
    "Locke": [{"bio":"These three young men, Seth Furey, Indian and Jase Ryan are in their twenties and posses the perfect ingredients that make up this incredible group, Locke. Lockes journey began with each member set on individual paths that ultimately led them to each other. Seth Furey, raised in Boston, MA began singing in his church choir at the early age of 8 years old. Growing up, Seth taught himself how to play the piano and saxophone while skillfully crafting his songwriting abilities. In 2004 Seth received a full four-year scholarship to Berklee College of Music, graduating in 2009 with a Bachelors degree in Music Business but not before moving to California to intern at Warner Music Group. While in pursuit of his dream of becoming an entertainer, Seths path led him to a young California producer who calls himself Indian. Indian, born Micheal J. Marcey II was raised in Southern California. He has been writing and producing since the age of 10. Indian, who has interned at major record companies, has been crafting amazing songs working with artist such as B2K, New Boyz, Jesse Powell and Teddy Riley. After meeting Seth, Indian got the idea to form Locke which led them to Jase Ryan. Jase Ryan was born and raised in Southern, California and began singing in his church choir at the age of 6 under the guidance of his father Robert Brown. As Jase grew up he developed a fiery passion and love of singing and could not shake the feeling of wanting to become a superstar"}] ,
    "Long Beach Shortbus": [{"bio":"Long Beach Shortbus was a reggae-influenced punk band from Long Beach, California. The band consists of four regular members: RAS-1 (lead vocals and guitar), Trey Pangborn (guitar), Eric Wilson (bass guitar) and Damion Ramirez (drum kit). Shortbus originated as a side project of RAS-1 and Eric Wilson, eventually taking shape after the Long Beach Dub Allstars disbanded in November 2001. The band is something of a Supergroup: Eric Wilson from Sublime and Long Beach Dub Allstars, RAS-1 also from Long Beach Dub Allstars, Trey Pangborn from the Falling Idols and Bargain Music and Damion Ramirez from Capitol Eye. The latter two bands, albeit not as well known, were quintessential Long Beach bands that helped influence the sound of Long Beach Shortbus today. Their first CD was a self-titled EP and featured their hit California Grace. Their second CD was entitled Flying Ship of Fantasy, featuring tracks from their first album. California Grace is also available on the soundtrack to the MTV reality series Laguna Beach. Sadly On October 7th, 2007, it was announced that the band will be parting ways. Their final show took place at the Haunted Ball And Chain festival in San Diego, CA, on November 2nd and 3rd."}] ,
    "Long Beach Dub Allstars": [{"bio":"The 1996 heroin overdose of Sublime frontman Brad Nowell left bassist Eric Wilson and drummer Bud Gaugh of the third wave ska revival band without their lead man (and Lou Dog without his master, Brad). The two musicians formed the Long Beach Dub Allstars with Opie Ortiz (the artist who created most of Sublimes tattoos and several of their album covers)on vocals, guitarist RAS-1 and Miguel, saxophonists Todd Foreman and Tim Wu, Jack Maness and Isaiah Owens on keyboards, and finally DJ Marshall Goodman. After releasing some singles and compilations, they released their debute album Right Back on DreamWorks in 1999. In 2001 they released Wonders of the World once again on Dreamworks. Long Beach Shortbus was formed after the Long Beach Dub Allstars disbanded in 2003 by the two founding members from Long Beach Dub Allstars Eric Wilson and RAS-1."}] ,
    "Look For The Signals": [{"bio":"Born on the eastside of Long Beach, California- Craig Cisneroz and Evan Dodd created Look for the Signals in late 2009, after the culmination of a previous project. Continuing on together, the singer / songwriter team has fused numerous genres and styles, creating something totally fresh- yet still possessing a hint of familiar flavor. L4TS recently completed their line up by bringing in LBC residents Eric Ehlers, a studio drummer and old friend of Craigs, and Jonathan Utt, the bassist from Craigs first band years prior in Chino, Ca. Whether performing acoustic or as a full band, L4TS are as versatile and raw as it gets. L4TS are currently in a song    writing frenzy, demoing 30 new songs! Are you Looking for the Signals? "}] ,
    "Lucky &amp; Wild": [{"bio":"Lucky & Wild, a new band on the scene, earned immediate online attention as the featured artist on Purevolume.com with the release of their first single Wrecking Ball. L&W followed up, releasing the Maniacs EP which hastily reached the No. 4 spot on Purevolumes most downloaded releases in July 2011. Lucky & Wild most recently performed with GLEE actor Corey Monteiths band as well as participated on Purevolumes All About You Tour. Although Lucky & Wild is a new band, songwriting and performing is no nothing new for the young artists. Drew Grethel, Sean Sobash, and Ed Larsen grew up as neighbors in a small beach town outside of San Diego performing music in a vast array of projects. Lucky & Wild represents over a decade of Drew, Sean, and Eds undying friendship, through the thick and the thin of growing up, L&W is the culmination of their past, and soon to be present."}] ,
    "Lunch Line Jones": [{"bio":"We Are Lunch Line Jones. Jayms Williams on Drums, Miles Daniels on Bass, Alicia Koch on Guitar , Cheeco Tovar on Guitar and Danny Davis on Vocals. We make original rock/funk/metal..ish music. Keep it    Rockin. We Try To Bring The Energy and Good Vibes . Come See Us at A Show. Buy me A Beer."}] ,
    "Lutan Fyah": [{"bio":"Much, much more than a deejay, much more than a singer and more than a chanter too Lutan Fyah also plays guitar, keyboards and the kette drum. He holds strong beliefs in originality at all times and so he is a songwriter too and, as the New Millennium has progressed, he has developed his very own idiosyncratic and unique vocal styling. He embraced the Rastafarian religion at the age of sixteen but his songs are not always strictly Rasta. As a living man with work to do he ranges over all subjects and everything and anything can inspire him to write, to play, to chant, to sing and to deejay. Preaching to the converted can prove to be a fairly easy task but to take the same message all around the world is a totally different ball game. Born Anthony Martin in Thompson Pen, Spanish Town in the parish of St. Catherine, Jamaica his formative years were spent in an environment where music was omnipresent. His grandfather ran a Sound System and artists such as Lt. Stitchie, Papa San and Lady G would gather in the familys yard to practise and perfect their skills on the microphone."}] ,
    "Matisyahu": [{"bio":"Matisyahu (born Matthew Paul Miller, June 30, 1979) is an American reggae musician.Known for blending traditional Jewish themes with reggae, rock and hip hop sounds, Matisyahu is most recognizable for being an orthodox Jew and writing a number of songs based on his faith and beliefs. Since 2004, he has released four studio albums as well as one live album, two remix CDs and one DVD featuring a live concert, and a number of interviews. Through his short career, Matisyahu has teamed up with some of the biggest names in reggae production including Bill Laswell and duo Sly & Robbie. The Tel Avivn Songfacts states several tracks of his fourth studio album, Spark Seeker, were recorded in Tel Aviv, Israel. Since his debut, Matisyahu has received positive reviews from both rock and reggae outlets. Most recently, he was named Top Reggae Artist of 2006 by Billboard as well as being named a spokesperson for Kenneth Cole. Matthew Miller was born in West Chester, Pennsylvania, USA on June 30th 1979, corresponding to the Jewish date of the 5th of Tamuz 5740. Shortly after his birth, the Miller family moved to Berkeley, CA and eventually settled in White Plains, NY. Growing up, Matisyahus parents sent him to Hebrew School a couple of times a week, but like many kids, he resisted the additional school hours and was frequently threatened with expulsion for disrupting the lessons. By the age of 14, Matthew Miller slid comfortably into the laid-back lifestyle of a teenage hippie."}] ,
    "Max Romeo": [{"bio":"Max Romeo (born Maxwell Livingston Smith, 22 November 1947, St. DAcre, St. Ann, Jamaica), is a reggae and roots reggae recording artist who has achieved chart success in his home country, and in the UK. The singer who put the rude in rude boy, Max Romeo was responsible for launching an entirely new sub-genre of reggae, whose overtly suggestive lyrics caused an outcry but took a massive hold of the music scene regardless. Yet innuendo was the least of the singers stylings, previous to the release of his infamous Wet Dream, Romeo had garnered a string of sweet hits with the vocal trio the Emotions. And once the nocturnal naughtiness faded, the singer established himself as one of the most important figures in the roots scene. He left home at the age of 14 and worked on a sugar plantation outside Clarendon, cleaning out irrigation ditches, before winning a local talent competition when he was 18; prompting a move to the capital, Kingston, in order to achieve a successful musical career. In 1965 he joined up with Kenneth Knight and Lloyd Shakespeare in The Emotions, whilst also working as a record plugger for Ken Lacks Caltone label. The group were unsuccessful in auditions for other producers, but Lack offered them an audition after overhearing Smith singing to himself as he worked one day. In 1966, the group had their first hit, with the Lack-produced, Buy You a Rainbow. The Emotions went on to have several hit singles and by 1968, the singer, by this point known as Max Romeo, felt confident enough to launch a solo career."}] ,
    "Micah Justice Band": [{"bio":"Micah Justice is a singer/songwriter from Southern California. A performer for most of her life, Micah began focusing on songwriting over a decade ago. She has played throughout the United States. She grew up listening to traditional country and classic rock and has fused these two styles into her alternative country sound. Her songwriting has been heavily influenced by writers ranging from Linda Perry to Dolly Parton. Her voice has been compared to Natalie Merchant and a bluesy Emma Lou Harris yet remains unique with its blend of her belty blues, and gentle folk style, jazz infused melodies. She has studied voice for over fifteen years in the styles of Opera, Jazz and Musical Theater. With years of classical theater arts training, she combines her training and experience with her natural charisma to create an inspiring stage presence."}] ,
    "Mick Stillz": [{"bio":"Mick Stillz is a rapper and producer originally from Rancho Cucamonga, CA. His witty flow, skateboarding background, and charismatic demeanor create a sound described by many to be quirky, yet catchy and current. In 2010, he released his first project, Neighborhood Nerd, which was hosted by Dj Ill Will and received just over 5,000 downloads. Following the positive response from his first project, Mick teamed up with Dj Ill Will for Neighborhood Nerd 2; this time reeling in over 8,000 downloads. In the Spring of 2011, Mick performed as the official opening act for New Boyz on their tour to Europe. While in Europe, Mick also opened for Travis Porter, Lumidee, Ja Rule, Dj Unk, and Lil Scrappy. With a popular single on international radio, Mick began headlining events at the same venues he was once opening at. Currently back in the United States, Mick is preparing for the release of his third project, Neighborhood Nerd 3, set to drop July 2012."}] ,
    "Misha Sisikin": [{"bio":"Making music since 1998, Misha Sisikin continues to perform his own compositions, as well as a variety of covers from a multitude of artists. Early on, Misha didnt practice as much as he should have, but over time, his skills, and passion, have honed themselves into what you see today. Working with a variety of groups and people, Misha continues to inject his musical influence to any project he can. In 2007, Misha released the album Now or Never with the group True Hearts MADness, and continues to collaborate with the same musicians in the current group Painted Soul. In 2010, Misha plans to release a solo album that is reminiscent of the True Hearts MADness sound, but with only one catch: he provides all of the instrumentation on the tracks. Although the piano is his first instrument, he delves into guitar, bass, and drums, as well as electronic arrangements."}] ,
    "Modern Archers": [{"bio":"Modern Archers is a 5 piece rock band whos members hail from all over San Bernardino county. The band fuses elements from a broad spectrum of genres ranging from Jazz, punk, metal and classic rock. Known locally for their energetic live shows, the band just released their first E.P. and are currently working on their debut full length."}] ,
    "Morgan Heritage": [{"bio":"Morgan Heritage is a reggae band formed by five children of famed reggae-artist Denroy Morgan. Despite their relative youth, they have been referred to as reggae royalty. Having grown up in their fathers music studio in the U.S. the group, then consisting of eight of the children, made their first appearance at Reggae Sunsplash in Jamaica. They were subsequently signed by MCA and released their debut album Miracles in 1994. They have since criticized Miracles as being overly pop-influenced.A year later the family moved to Denroys homeland of Jamaica. In this period, three family members left the group. In Jamaica, Morgan Heritage began working with famed reggae producers Bobby Dixon and Lloyd James, resulting in the release of the critically acclaimed album Protect Us Jah (1997), followed by One Calling (1998), and the spiritually-inclined Dont Haffi Dread (1999). They released two albums by The Morgan Heritage Family and Friends, and the Live in Europe! album recorded on their 2000 tour. Morgan Heritage toured in Europe again following the release of their 2001 album More TeachingsÉ Their sixth studio album, Three in One, came out in 2003. They have released two DVD`s (Live In London and Live Over Europe 2003) with good success and Full Circle (2005)There is a sibling band called L.M.S which is more hip-hop influenced without a band, that often tours with them and is a part of their family, as well as their father Denroy Morgan."}] ,
    "My Own Holiday": [{"bio":"My Own Holiday is a Rock n Roll/Blues Duo from Southern California. The bands broken-down approach is electrifying live, very throwback blues/classic rock and reminiscent of the nineties. Bands like this are formed in garages, basements, and cross-country trips. Drunk or sober music has been written, played, created, and recorded for anyone who wants to listen... Brought to you by My Own Holiday."}] ,
    "Mystic Roots": [{"bio":"Serving up an original style based in reggae, hip-hop, and dancehall (with overtones of rock, funk, and ska), a Mystic Roots Band live concert guarantees not just at music for your ears, but also a high-energy show and powerful experience youll never forget. This Chico-born, now San Diego-based group brings a brand new sound while embracing the nature of roots reggae wholeheartedly and performing it with smooth vocals/harmonies, energetic freestyles and beat-boxing, all over a solid groove. The music and lyrics are catchy and upbeat, yet with a powerful, positive message. The musicianship of the players is top notch and arrangements are often complex and always interesting. The band tours the U.S. full-time, playing shows with some of the biggest names in reggae, hip hop, and rock. MRB promotes positivity and spreads a conscious message while still having a good time and keeping the party going. Fans describe MRBs music as a refreshing, energetic, and cutting-edge sound that people are immediately drawn to. As a result, MRB has developed an ever-growing legion of loyal fans. This fan base exists not only in the United States, Canada, and Mexico, but also in Europe, Latin America, Australia, and even several regions of Asia."}] ,
    "Natural Heights": [{"bio":"A sublime fusion of modern reggae and classic sound explains the essence of Natural Heights. This California based band was established in February of 2010. The four members; Ryan Pipitone, Jesse Vargas, Juan Canales, and Scott Hall, came together to express a positive outlook on life and music. Natural Heights has already been touring nation wide, which has made it possible to release their first EP in the summer of 2010. Independently booking shows and capturing new fans within every city, they are seeking new outlets for future opportunities and growth. Within a short period of time, Natural Heights has been featured in local city magazines and Internet radio productions. With all members stating that the Sky is the Limit, they each bring their own unique energy to the music. Playing drums since he was three years of age, Jesse Vargass influences are his Father, Chad Sexton, Tony Royster Jr. and Kobe Bryant. Expressing his experiences through his intricate melodies and range, the vocalist, Scott Halls influences include Tom Petty and Bradley Nowell. Captured by many different styles and techniques, Bassist, Ryan Pipitone, looks up to Eric Wilson, Victor Wooten, P-nut of 311, and Flea of the Red Hot Chili Peppers. Lead guitarist, Juan Canales, nicknamed by the band Stevie Ray Juan, studies the influences of John Frusciante, Mike Einziger and Adam Jones to inspire his style and tone. Be sure to watch out for the upcoming tours and EP from Natural Heights this summer of 2010. "}] ,
    "No Bragging Rights": [{"bio":"After three solid years of touring the U.S., Canada and Mexico, Southern California Melodic Hardcore band No Bragging Rights has released their new full length album titled ILLUMINATOR under BlkHeart Group. Recorded at Lambesis Studios (Tim Lambesis - As I Lay Dying) with producer Daniel Castleman ( Winds Of Plague, Impending Doom, As I Lay Dying). Attempting to Out-Do their previous release and streamline their signature sound, the band has stepped in a heavier, more passion driven direction. Vocalist Mike Perez states We felt we needed to cut the fat. Make the heavy parts heavier, the fast parts faster, and the choruses memorable. The album deals with disappointment of heartless music, the struggles of tour life, and the state of the music industry today. Perez proclaims In dark times, there needs to be somebody to carry the torch and light the way for others to follow, to be an ILLUMINATOR."}] ,
    "No Motiv": [{"bio":"No Motiv is an alternative rock and punk rock band from Oxnard, California signed to Vagrant Records. As of 2006, No Motiv were the oldest Vagrant band, having been with Vagrant Records longer than any other artist on the Vagrant roster. The current No Motiv line up includes former bassist Roger Camero behind the drum kit. Camero never left the band, but rather moved to the drums when drummer Pat Pedraza left the band to join alternative rock band From Satellite. Their first album, Cynical, was distributed by Edge Records. No Motiv eventually left Edge for unspecified reasons, though a falling out is what is assumed. Their second album Scarred is a collection of unreleased demos and remixes also released by Edge Records. The band is known for rarely, if ever, playing songs from these two albums at their live shows. Friends of the band have also been noted as saying that there are demo tapes that sound better than the quality on Scarred. The band had its greatest success with the 2004 release Daylight Breaking, which reached #36 on Billboards Top Independent albums chart.During the past two years, No Motiv has played only one live show. It took place on June 11, 2006, at the Livery Theatre in Ventura, CA, as a benefit show for the closing of the venue, as well as a reunion of legendy sadcore band The Whereabouts."}] ,
    "Noa James": [{"bio":"Rapping since the age of 13, Noa James began his musical journey as a successful battle rapper who quickly became known for his brutal punchlines and sharp tongue. After 5 years in the battle circut Noa realized that he wanted more as an artist and although he was young he knew he had a big story to tell. As a young man Noa experienced more struggle than most people experience their entire lives ranging from his mothers incarceration after abandoning him, his stay in an orphanage, the deportation of his father, and perhaps the most prolific moment in his life; the passing of his beloved grandfather. With such a powerful story to tell, Noa decided to enroll in a writing class at the local community college to help him transfer his thoughts and struggles on paper in a way that truly exposed his reality and emotions. Over the years Noas autobiographical rhymes have made him a pioneer in the art of story telling and although his powerful stage presence and large stature has made him a force to be reckoned with it is the size of his heart,that has remained most imminent. Not only making a name for himself as an artist, Noa is also widely known as leading force in the Inland Empire underground hip hop movement, creating a stage for aspiring artist and rappers alike to express their creativity in a positive environment at his weekly open mic event in Riverside, CA called The Common Ground. Noa also holds various charity events to support programs and shelters in surrounding communities including is annual toys for tots event to support Mercy House as well as clothes and food drives to give hope to the less fortunate."}] ,
    "None More Black": [{"bio":"None More Black is a New Jersey-based punk rock band. They were formed in 2000 by lead singer/guitarist Jason Shevchuk after the demise of Kid Dynamite. Their name originates from a line in mockumentary movie This Is Spinal Tap. Several of the bands song titles are references to jokes from the television show Seinfeld. Jason left Kid Dynamite so that he could finish film school, and to sort some things out. While at school, Jason had written some songs and would play them with his roommate Dan and a drum machine. By 2000, they had a second guitarist and a real drummer. That lineup soon fell apart, but by 2001 Jason and Dan had recruited Jasons brother Jeff, along with a new drummer. But after recording a 7 for Sub Division Records, that lineup fell apart, this time leaving only Jeff and Jason. But finally in 2002 (after a few more lineup changes) a solid (or so it seemed) lineup was established, featuring Paul from Kill Your Idols on bass. A demo was recorded, circulated, and the band went on to release their first full length on Fat Wreck Chords. The band split up in 2007. On July 7, 2008 the band announced on their Myspace blog that they have decided to re-form and will be recording a new album."}],
    "Odd Mob Order": [{"bio":"No bio avaliable"}] ,
    "Old Tiger":[{"bio":"Hey yall, Dustin here - just wanted to clue you guys into whats happening in Tigerland. Some of you may know, we started doing this Old Tiger thing back in 2009, and ever since then its been an incredibly long string of constant shows, writing, recording, and rehearsing. Even though its been some of the most rewarding experiences Ive ever been a part of (and Im sure the other guys can say the same), it can also be very tiring and can wear you down over time - especially if there arent any real breaks involved. Now its almost 4 years later and were finally at the point where putting our feet up and catching our collective breath doesnt seem like a bad ideaÉ..so thats what were doing. Weve all still got a lot on our tables, personally and otherwise, and that means you can still catch Matt & Eric tearing it up around town in The High Rolling Loners (and Eric in The Darrows), while Ive got new albums with Boy King and a newly sprouted band with my friend Jake Najor, Chess Wars, coming out.  So if yall dont mind, were gonna use some of that long-accrued vacation time and hit you guys up down the line. Dont forget about us. Please keep Love Have Mercy on blast (its our baby) - and take care of yourselves!"}] ,
    "On Being Human": [{"bio":"Formed in Murrieta, California, the band On Being Human is made up of Travis Baker, Beau Trembly, Greg Lesondak, Scotty Pulliam and Greg Johnson. Their new EP eVe was released in January 2013. Building more upon their electronic and orchestral influences the band combines the traditional hard rock formula to create a sub-genre they entitle Adventure Rock. eVe along with its LP counterpart In Search of Adam (Set for fall 2013) was self-produced by the band and tracked partially at Alchemy Studios in Murrieta, California. Both new releases were executive produced by Innovation Films. In 2009 after living in Germany for seven months, writing their debut album, the band returned to the States and released To Light the Coals of Hearts. Hot Topic took notice and selected On Being Human as their Unsigned Band of the Month in July 2011. On Being Human also double as composers and have their music and orchestral compositions featured in films (The Package Vol. 1, Lockdown: Red Moon Escape), television (Discovery Channel, History Channel, Travel Channel) and video games (Rocket Racing League, AMBL, Galactic Bowling, Top Hand Rodeo Tour), as well as several other international documentaries and commercials. In Late 2012 the band was invited out to Doha, Qatar where they had their music featured in four films produced by Innovation Films that all premiered at the Tribeca Film Festival where Innovation Films is based."}] ,
    "Painted Soul": [{"bio":"Hello! Were Painted Soul. The music we make is how we get a handle on our lives and bring our joy, angst, sadness, confusion and excitement into focus. Painted Soul is comprised of Aaron Berry (Guitar, Vocals), Misha Sisikin (Keys, Vocals) and David Knapp (Drums, Vocals). We hail from the Inland Empire in Southern California, but our roots reach all over the southland. Aaron knew from the beginning that his calling was music, and as a result has dedicated his life to music and the guitar, which he has been playing for nearly 8 years. He has played in a number of bands with a variety of different styles, ranging from heavy metal to country based acoustic work. Misha was raised in Los Angeles before moving to the IE, and has played the piano for over 13 years. He was trained with a classical background but quickly found piano based rock and roll, and the rest is history. David grew up in Oceanside, California, moved to the Inland Empire, and is now currently living in San Luis Obispo, going to Cal Poly. He has been playing the drums for over 6 years and has played a variety of styles from rap and metal to reggae, big band, and of course rock. Painted Souls influences include Led Zeppelin, Queen, Pink Floyd, U2, Elton John, Foo Fighters, Rolling Stones, Roxy Music and many moreÉ This is who we are. Join us on our journey."}] ,
    "Peace Of Mind": [{"bio":"Pair of teen who love making music for others enjoyment. Coming out from Oxnard and no its not just another hardcore punk band its the mix genre, Peace of Mind. Growing for 90s grunge and punk scene to nu metal in the early 2000s peace of mind is a 3 member group of a guitarist/vocalist (ricky), bassist/backup vocalist (gets), and percussionist/drummer (luis)."}] ,
    "Peace Of Soul": [{"bio":"No bio avaliable"}] ,
    "Pepper": [{"bio":"No bio avaliable"}] ,
    "Peter Tosh": [{"bio":"Peter Tosh, born Winston Hubert McIntosh (19 October 1944 Ð 11 September 1987), was a Jamaican reggae musician who was a core member of The Wailers who then went on to have a successful solo career as well as being a trailblazer for the Rastafari movement. Peter Tosh was born in Petersfield (Westmoreland, Jamaica) with a father and mother too young to take care of him. He grew up raised by his aunt. Nicknamed Stepping Razor, he began to sing and learn guitar at an early age, inspired by American radio stations. After an illustrious career with The Wailers and as a solo musician, he was murdered at his home during a robbery. He often struggled in Jamaica with his group the Wailers (aka the Wailing Wailers - the group included Bunny Wailer and the world-renowned Bob Marley). Tosh joined them on a tour of England in 1972. This was to become his first step to world fame, as during this trip the group signed with Chris Blackwells Island Records. Their first album for this record label was the classic LP Catch A Fire. This album represented an entirely new breed of reggae, which meshed Jamaican roots riddims with American soul music and British rock.A tour of America and Britain followed as well as several successful albums. However, tension grew within the group, especially between Peter Tosh and Bob Marley, as Tosh witnessed Marleys persona within the group overshadow his own. Both Tosh and Bunny Wailer left in 1975 in pursuit of solo careers. Toshs solo career included a series of major hits."}] ,
    "Phat Cat Swinger": [{"bio":"One of the best bands to dance to in the surrounding Los Angeles areas, Phat Cat Swinger was influenced by the classic sounds of Bobby Darin, Louis Prima, and Frank Sinatra and mixed with the new swingin sounds of such bands as Big Bad Voodoo Daddy, Royal Crown Revue, and Brian Setzer, Phat Cat Swinger is a band filled with booming toms, walking bass lines, jumpin guitar rhythms, roaring horn lines and smooth vocals. Founded by alto sax player Marco Palos, baritone sax player William Pattison, and former members Matthew Burdick (drums) and Sebastian Western (guitar) nearly seven years ago, Phat Cat Swinger is one of the hottest live swing bands to hit Southern Californias underground scene. With their rise in popularity Phat Cat Swinger has toured the country, crossed over to Europe and performed shows alongside Big Bad Voodoo Daddy, Cherry Poppin Daddies, Royal Crown Revue and even alongside Shirley Jones. A big break for this band came when they made an appearance in Christina Aguileras Candyman music video, where they performed in the beginning scene of the song dressed up to the nines in white suites; and have recently played for the Stars And Stripes Benefit at the venue of every mans dream, the Playboy Mansion."}] ,
    "Pierce the Veil": [{"bio":"Pierce the Veil is an American rock band from San Diego, California. Formed in 2006, the group was founded by brothers Vic and Mike Fuentes after the disbandment of the group Before Today (formerly Early Times), which was formed out of the San Diego punk rock scene. Pierce the Veil has released two studio albums and has continuously been inducted into several worldwide tours since the release of their debut album, A Flair For The Dramatic in 2007. A new album, titled Collide With The Sky, was recently announced for release on July 17th, 2012, under the label Fearless Records. Embracing their defiant brand of progressive post hardcore and gaining a rabid fan base thanks to their incredible live show, Pierce The Veil have become a hot commodity over the past few years. But with the release of stunning new album Collide With The Sky, the San Diego natives are truly en fuego. Deploying every shred of musical prowess in their artillery, Pierce The Veil have poured heart and soul into new album Collide With The Sky - and it shows. Blending the unique vocal style of singer Vic Fuentes, incendiary guitar lines and soaring melody, the bands third album is an aural exploration that at once both packs a punch, while finding the pockets of calm in the chaos - a talent that has made the band such a refreshingly exhilarating force in the scene. Having toured with some of the biggest names in the music, including Bring Me the Horizon, A Day to Remember, Of Mice & Men, Thursday and The Devil Wears Prada, the band tear into a packed tour schedule in support of Collide With The Sky, with a full summer on Vans Warped Tours main stage and a UK headline tour this fall."}] ,
    "Postmodern": [{"bio":"Postmodern is the brainchild of singer/songwriter Jamie Salazar.Embarking on an ambitious yet trying journey after his release of 2005s My Heavy Heart. Jamie Salazar plans on bringing Postmodern to new heights with undeniable songs and a sound of charm and glitter. Postmodern is no stranger to a wide variety of styles in his music. This project hails from Redlands ,Ca smack-dab in the middle of the I.E.s Pop Punk and Metal scene. Make no mistake he has his eye on the prize with catchy and melodic tunes sure to be haunting your ears long after the first time you hear them."}] ,
    "Pour Habit": [{"bio":"Believe it or not, things used to be different. People used to start punk bands because they wanted to have fun, not because they needed a vehicle to get their faces on the covers of magazines. Artists used to tour to meet new people, not to sell products in various markets. Above all, especially in the punk scene, bands in the past didnt believe in a division between themselves and their fans because at the end of the day they knew we were all the same. However just when things seem to be at their bleakest and most dismal Compton, Californias Pour Habit have come along and remind us all about why we got interested in punk rock in the first place and the fact that they have gained a reputation as the band of the people is no coincidence. Initially started by Steve and Chuck as a trio in 2005 in Compton, California, the band underwent a series of member changes and instrument swaps before landing on the perfect lineup of Chuck (vocals), Colin (drums), his brother Eric (guitar/vocals), Shaun (guitar) and Steve (bass/vocals)and they havent looked back since. After gaining a local following performing with Authority Zero and Guttermouth and building an enthusiastic fanbase in California, the group entered the studio in 2007 to record their debut full-length, Suiticide. We barely had enough money for a week in the studio and that album is pretty much a live CD, Colin explains, adding that his drum tracks were cut in one take. It was a good learning experience and were proud of it."}] ,
    "Psychedelic Milk": [{"bio":"Psychedelic Milk packs a mighty punch of desert influenced vibes that is slowly infecting the underground rock scene. Their music is an absolute enthralling listening experience that makes you want to hit the gas pedal and rock out."}] ,
    "Queen Ifrica": [{"bio":"Queen Ifrica born Ventrice Morgan, began her career in 1995 after shining at a local talent contest in her hometown of Montego Bay, Jamaica. With roots firmly secured in the Rastafarian faith, she blossomed as one of the top cultural artists in reggae swarming the airwaves with hits like Below the Waist and Daddy and stealing the stages at major festivals and stage shows around the world (Summer Jam in Germany, Sierra Nevada World Music Festival, Bob Marley Festival, Reggae on the River in California and Reggae Sundance Festival in Holland). As an active community leader, Ifrica is involved in several outreach programs for children in Jamaicas inner-city and charity shows where proceeds are donated to the cause."}] ,
    "Queen Omega": [{"bio":"Queen Omega hails from San Fernando in the caribbean island of Trinidad. Encouraged by her mother (to whom she pays moving tribute on Mama), she began entering local talent shows from the age of nine, writing her own calypsos and even rapping on national television. Later on she sang backing vocals for local producer Kenny Philips, accompanying numerous top Soca acts both in the studio and on stage. Raised in a musical family, shed grown up listening to soul artists like Aretha Franklin, Anita Baker and Whitney Houston, as well as jazz and the traditional music of Trinidad. Such foundations were to serve her well later on; her favourites however, were reggae and dancehall. Inspired by the teachings of Emperor Haile Selassie I, her song writing skills soon blossomed, with roots and reality themes coming to the fore as her love of Rastafari deepened. It was on a trip to Jamaica with the Solomon Band where she performed at the Caribbean Music Expo in late 2000 that she met producer Mickey D, who brought her to London the following year for sessions that resulted in her debut set, Queen Omega. This was followed by several hit singles and a second album titled Pure Love. Early 2004 Jet Star released Away From Babylon, Queen Omegas third and most accomplished album then, finding her still residing within Mickey Ds Green House Family. With these three albums and many well received live performances, Queen Omega has been absolutely blazing a trail for female roots reggae artists."}] ,
    "Radiator BBQ": [{"bio":"No bio avaliable"}] ,
    "Rebecca Connelly": [{"bio":"Singer/songwriter Rebecca Connelly pours such passion and devotion into her music that listeners cant help but be flooded with emotion and memories of the beautiful struggle called life. Her voice has been compared to that of Jewel and Natalie Merchant and described as pure, sweet, and full of emotion. Her diverse musical style defies genre, but if necessary her songs can be categorized as pop/rock with a twist of folk. Rebecca was raised in a very musical household and was fascinated by the creativity of her grandads singing/storytelling. At a very young age she knew that making music was her passion, and she now describes it as a relationship you cant leave, and it never leaves you. Rebecca departed from her native Scotland five years ago and came to America, where she has been dedicated to moving forward with her career in music. Her first album, Coming Home, was recorded in a friends recording studio in Palm Springs and provided the buzz she needed to break into the California music scene. Selling dozens of copies of the album at her live shows, the album was well received by fans and critics alike. In 2010 Rebecca won Best Female Artist in the SoCal Live Music Competition for her song Hollywood, which gained her acceptance in the U.S. music scene as well as publicity for her music. Since then, Rebecca has brought together an ensemble of musicians and production staff to complement both the poetic candor of her voice and the powerful emotions and imagery that define her songwriting. Her band, Dolalay, released their debut EP Days Like This in Feb 2012 and just returned from touring the UK. Rebecca is already back in the studio recording her second solo album, due to be released in December 2013, and she plans to tour Canada next year, along with some small U.S. and UK tours. Her new album will have a greater emphasis on piano and be more upbeat, fierce, and fun compared to her last album. With hopes of eventually getting her music into film and television and being signed by a label, Celebrity High Magazine was right when they said that this young singer has A LOT of potential and the drive to go far."}] ,
    "Rebelution": [{"bio":"On Jan 10th, 2012 the Santa Barbara, CA based band Rebelution released Peace of Mind through their own label 87 Music in partnership with Controlled Substance Sound Labs. Peace of Mind was released as a multi-length triple album which includes Peace of Mind: Acoustic as well as Peace of Mind: Dub. Marking the highest chart debut of Rebelutions career, Peace of Mind debuted at #13 on the Billboard Top 200, #1 Reggae and #1 Independent albums as well as #4 on the iTunes overall album chart. The band previously had four top 10 albums on the Reggae chart and their 2009 release Bright Side of Life debuted at No. 54 on the Top 200 and #1 Reggae. Rebelution kicked off their Peace of Mind Tour the day after the release, selling out shows at Phillys The Electric Factory, The Hollywood Palladium, Denvers The Fillmore, The Fox Theater in Oakland and Hard Rock in Orlando, FL. The tour made stops in a total of 42 cities across the country. Summer 2012 was spent supporting O.A.R on their Amphitheatre tour, headlining four amphitheaters in Florida as well as festival performances at Outside Lands, Hangout, Forecastle, Summer Camp, Summer Set, The Allman Bros Peach Festival and two performances at Red Rocks Amphitheatre. After completing a Fall tour of the East and South East, Rebelution will be headlining The Hollywood Palladium on New Years Eve, heading to New Zealand for the Raggamuffins Festival in February and headlining their annual Winter Greens Tour around the USA in Feb - May 2013."}] ,
    "Rochester": [{"bio":"No bio available"}] ,
    "Romain Virgo": [{"bio":"In 2007, Romain Virgo made history as the youngest contestant ever to win Digicel Rising Stars, Jamaicas talent competition, at the age of 17. Virgo was sensational throughout the 2007 competition and outshone his opponents with singing skills that seemed to stretch beyond the talent of a 17 year old. Now two years later, his career definitely seems to be on the rise. His single Cant Sleep is still climbing up the Jamaican charts and already gained him attention outside Jamaica as well. Love Doctor on the Automatic riddim is already getting loads of airplay as well as his single Wanna Go Home. Romain Virgo manages to build his musical career while still doing a five-year bachelors degree in performance at the Edna Manley College of the Visual and Performing Arts in Kingston, studying for a major in voice and minor in keyboard. This education assures that Romains performance will be different from others. It already earned him a performance at Tony Rebels prestigious Rebel Salute 2009 show earlier this month and performances at the well known dancehall parties in Kingston such at Passa Passa in Tivoli gardens and Weddy Weddy at Stone Loves Headquarters in Kingston. With hard work, Romain is taking it one step at a time and will be out there and let the people know what he has to offer. Romain has been working with Donovan Germain of Penthouse Music and Dawin Brown of Vikings Sounds"}] ,
    "Roots Tonic": [{"bio":"No bio avaliable"}] ,
    "Rosehot": [{"bio":"Attitude driven. In your face. Blues that will make your soul cringe, yet metal that will leave you no option but to headbang. The aggression of Punk, with the hooks of a Pop artist. The sound of ROSEHOT will kick you in the teeth and will leave you asking for more. With influences like Led Zeppelin, Megadeath, The Rolling Stones, The Who, Guns and Roses, and many blues artists, you feel the fine combination of sound stirring in your chest when hearing their music. On stage, they share the same spontaneity as the way the band got its name. During an STP concert on an outdoor sage in Hollywood, they saw the sign to the Roosevelt Hotel off in the distance. It was covered half way to where it read Roose and below it, Hot. One o was not lit in the Roose, leaving it to say ROSEHOT. Singer Jonathan Easley and Bassist Gabriel Martinez had been friends since middle school, and in and out of bands together throughout high school. That is why when years later, after Jonathan became introduced to the blues/metal guitar stylings of Jovan Zebrowski at a mutual friends jam session, he called Gabriel to join in the next session. There was an instant chemistry between the three, and the foundation of something big had been laid. At last, the band found a permanent drummer in Kevin Bothwell in summer of 2011. Spending late nights out on town from bar to bar most of the time is what inspired the energetic, pulse pounding music they are cranking out at every show. They a one of a kind band that are out to bring the sleazy, sexy hard rock vibe that is missing in todays mainstream music. They are captivating, talented, badass, and they have exactly what it takes to get that done."}] ,
    "Rufio": [{"bio":"Rufio is a melodic punk rock band from Rancho Cucamonga, California. All the members of the band went to the same high school together. The band was formed when original bassist Jon Berry was in freshman year in college and the other three band members were in the final year of high school. The other three band members are Scott Sellers (Vocals/Guitar), Mike Jimenez (Drums), and Clark Domae (Guitar). Guitar players Scott and Clark were acquaintances at young ages as they grew up together. Scott then met lead bassist Jon Berry, and they began playing together immediately in various groups and sessions, as well as purchasing a 4-track to record the songs they have written together. After Berry and Scott began recording music, they asked Mike to play drums for them and listen to their recordings. Shortly after the addition of Mike, Clark joined and the band was formed. The band got their name from the character Rufio, leader of the Lost Boys from the Peter Pan-inspired film Hook. Rufio released their debut recording in 2001 on The Militia Group label, Perhaps, I Suppose, which was interpunk.coms top selling album ever for at least 3 years, only recently eclipsed by Operation Ivys Energy. The band returned in June 2003 with MCMLXXXV (released on the Nitro label), which was recorded with the aid of producer Nick Rasculinecz who has also recorded with Foo Fighters and Rancid. Rufio went on to play on the Warped Tour that summer following the release of their second album. Their third album The Comfort of Home was released in July 2005."}] ,
    "Sarah McLaughlin": [{"bio":"No bio avaliable"}] ,
    "Savvy Sossa": [{"bio":"Pomonas own Savvy Sossa, independent hip hop artist,burst onto the scene in 2009. His first single, Chop it up, featuring LX received radioplay on 99.1 FM KGGI. Since that breakthrough hit his singles have included Wake Up Next to You, featuring LX on 96.3 FM Latino ,Lost in Love, featuring Beach Boy on 96.3 FM Latino, Amy Winehouse featuring Ike Nice TheBaka Boys Hip Hop Master Mix, syndicated show which includes Q104.7 and more than 60 other radio stations. Savvys lastest release Bedroom Stripper, Tay F 3rd can be heard on 94.5FM in Detroit and Hot97FM Boston. Savvy, who has been called the hardest working indy artist in the IE, is currently working on a new mixed tape called Project X which will include his new single, Loaded expected release in August."}] ,
    "Science Fiction Theater": [{"bio":"Science Fiction Theaters debut album was released in the Spring of 2009. Although it received little commercial push it managed to make its way onto a handful of music journalists best of 2009 lists. The Inland So Cal dubbed the band pop rock superheroes while the Press Enterprise had this to say about the album. Science Fiction Theaters self-titled full-length should be on the top of music critics lists everywhere, thats how great this album is. The Rancho Cucamonga outfits power pop tendencies take cues from the accessible hooks of a band like Fountains of Wayne, but also add a reserved maturity to the lyrics and make for an album thats going to have staying power for years to come. The band also had some good fortune on radio stations such as Los Angeles based KROQ 106.7 (Locals Only) and x103.9. In 2011 the band was approached by an animator to write and record a theme song for an animated podcast featuring Kevin Smith (Clerks, Mallrats, Zack and Miri Make a Porno), Kevin Hardwick (from MTVs Singled Out), and more."}] ,
    "Set Your Anchor": [{"bio":"We stand for a positive movement and are here to promote our message to stand up and fight for what you believe in, and never give up on your hopes and dreams."}] ,
    "Shoppy": [{"bio":"The dynamic and iconoclastic trio known as Shoppy sounds more like a six-piece funk orchestra playing alternative music with jazz sensibilities than they do a trio of musicians. Simply put, they pack a lot of sound for simply three people. Consisting of lead singer and drummer Chad Villarreal, bassist Matt Wyckoff and multi-instrumentalist virtuoso Gabe Hartman, who plays keyboards, saxophone and the occasional flute for good measure, the picture of how this obscure trio pulls it off becomes clearer.Major Shows Played: KROQ Inland Invasion, Riverside Orange Blossom Festival. Bands Played With: Social Distortion, Weezer, Incubus, Berlin, Long Beach Dub All-Stars, The Offspring, Alien Ant Farm, The Color Red"}] ,
    "Silence The Radio": [{"bio":"No bio avaliable"}] ,
    "Sizzla": [{"bio":"Sizzla Kalonji (real name Miguel Orlando Collins) is a Jamaican reggae musician. He was born on 17 April 1976, in St Mary, Jamaica, of devout Rastafari parents and raised in August Town. He is unusually prolific, even by Jamaican standards. Sizzla has worked with such artists as Mobb Deep. Sizzla, along with reggae recording artists such as Capleton, Buju Banton, and Anthony B , are credited with leading a movement toward a re-embracement of Rastafarian values in contemporary reggae music by recording material which is concerned primarily with spirituality, social consciousness, explores common themes, such as Babylons corrupting influence, the disenfranchisement of ghetto youth, oppression of the black nation and Sizzlas abiding faith in Jah and resistance against perceived agents of oppression. Sizzla has over 40 full completed albums sold in record stores to date, the most popular which have been Black Woman & Child and Da Real Thing on the Digital B label, Praise Ye Jah on Xterminator, and Rise to the Occasion on Greensleeves. Recently, however, he has come under fire for the homophobic content of many of his lyrics, and the advocacy of violence against gays."}] ,
    "Skyline Collapse": [{"bio":"Skyline Collapse are a melodic hardcore punk band from Victorville, California."}] ,
    "Sleeping Giant": [{"bio":" Sleeping Giant represent a great and terrible day when all living things will return to dust; and their sound is as formidable as one might suspect the apocalypse should be. Sleeping Giant charged onto the Redlands, CA scene in 2006 with their bold and powerful live show, where in addition to being entranced by ominous guitars, crowds are met with burning passion from articulate front man Thom Green. The sincerity behind the words that pour out from Greens mouth is deeply rooted in the bands unwavering love for The Lord. Sleeping Giant are resolute in their goal to reach as many people as possible with their message of repentance; but their music is anything but single-minded. The diversity of sound on their debut Dread Champions of the Last Days is striking, and listeners will find the bands ability to morph seamlessly from one track to the next to be unforgettable. We are called Sleeping Giant because Christians in the world today are just that, in the world. And they need to wake up! They are sleeping giants of war in this world over-run by apathy, by people who do not see the enormity of their worth and dont realize they live their lives day by day forsaking love, and a just and amazing God who deserves it all."}] ,
    "Slick Shoes": [{"bio":"Slick Shoes was a pop punk band with Christian origins from Antelope Valley, California. Their name comes from the hit 1985 movie, The Goonies, slick shoes being one of the character Datas many gadgets. The band formed in 1994 and made their first release as a self-titled EP in 1997. They released 5 full length CDs, 4 of them on Seattle based Tooth and Nail Records. They also released an EP, a split with Autopilot Off and a greatest hits CD entitled The Biggest & The Best, featuring 3 previously unreleased songs. Slick Shoes style could be described as fast and melodic, occasionally with a rough-edged hardcore punk/melodic hardcore sound. The band had gone through numerous line-up changes over the years, but singer Ryan Kepke and Joe Nixon (drums) performed on every release, while Jeremiah Brown (bass) played on all except their final album, Far From Nowhere. This was their first release without Tooth and Nail Records, which they left, not for religious reasons, but merely because their contract had finished and the band felt the need for a change. Far From Nowhere was released on SideOneDummy Records in the summer of 2003. The band was particularly successful in the Christian punk scene in the late 90s and early 2000s and toured alongside their peers, both secular and Christian (most notably bands such as Face to Face and MxPx, respectively)."}] ,
    "Slighty Stoopid": [{"bio":"Slightly Stoopid are a rock band which formed in Ocean Beach, California, United States in 1995. The band consists of Miles Doughty (vocals, guitar, bass), Kyle McDonald (vocals, bass, guitar), Ryan Moran (drums), Oguer OG Ocon (percussion, harp), DeLa (saxophone) and C-Money (keyboards, trumpet). Since their formation they have released seven albums: Slightly $toopid (1996), The Longest Barrel Ride (1998), Everything You Need (2003), Closer to the Sun (2005), Chronchitis (2007), Slightly Not Stoned Enough To Eat Breakfast Yet Stoopid (2008) and Top of the World (2012). Slightly Stoopid was formed in 1995 in Ocean Beach, California by childhood friends Miles Doughty and Kyle McDonald. Soon after, Sublime frontman Bradley Nowell discovered the duo and asked them to perform a set at the Foot Hill Tavern in Long Beach, California. Nowell immediately signed them to his label, Skunk Records, while the band was still in high school. A pair of releases soon followed1996s punk-tinged Slightly $toopid (featuring a guest appearance by Nowell on the song Prophet Ð later covered by Sublime and released on their box set, Everything Under the Sun) and 1998s surf-inspired The Longest Barrel Ride. The group self-released 2001s Acoustic Roots: Live and Direct (a 40-minute acoustic set, captured live at San Diego s Rock 105.3 radio station) Ð the first for their own label, Stoopid Records, before issuing 2003s Everything You Need on Surfdog (a musical departure for the band, that sold more than 130,000 copies)."}] ,
    "Smirk": [{"bio":"No bio avaliable"}] ,
    "Smoke Fills the Air": [{"bio":"After a two year long hiatus following the dissolution of their previous band, the members of Smoke Fills the Air finally got together to write a hand full of songs in 2011. Out of necessity Victor decided to take over vocals (although not exactly a natural he is constantly working on it), while Steve and Danny began taking more active roles in background vocals. Victor switched from the electric ...bass to the upright bass, for driving slap rhythms, and poetry through bowing. Steves classically infused melodies breathe new life into both classical music and modern rock, adding a touch of the melodramatic to songs of tragedy and horror. Dannys pace is as furious as ever, alternating slow and fast tempos at key moments while adding devastating fills. Together these three form the three-piece band Smoke Fills the Air, a band striving for a different sound. A year of work in the studio has culminated in the up-coming release of the bands debut self-titled album, set to be released in early 2012."}] ,
    "Soul of the River": [{"bio":"Making listeners slap themselves black and blue out of pure eargasmic joy since your momma was born. Created around freestyle songwriting sessions around a fire pit, Soul of the River was formed in June 2002, out of Southern California, Soul of the River has a unique sound coupled with great songwriting is guaranteed to make even the harshest critic get down with the get down. Soul of the River completed their first full length album late 2011. Soul of the River were voted Best Roots at the 2010 Inland Empire Music Awards and Best Classic Rock band at the 2009 Inland Empire Music Awards. Soul of the River have been featured on X-103.9 Alternative Radio, KUCR Good Morning San Diego, and the Internationally syndicated On the Horizon Radio Show. Soul of the River provide several free downloads on their website. Soul of the River are strong supporters of the American Cancer Society, and perform at several Relay For Life events every year as well as hosting and performing their annual Rock for the Cure concert to raise funds for the Riverside, Perris, and Hemet Relay for Life events."}] ,
    "Spirit Fangs": [{"bio":"Spirit Fangs have come along way since the very beginning. What started off as two teenage dudes playing music with a laptop in a record store has now become five Dudes from the Inland Empire playing energetic Loud Rock, giving the crowd something fun to watch and hear. Spirit Fangs released their Debut EP The Roots That Grew Underneath and Tangled Up my Feet in Summer 2008 and played local house parties and bars showcasing a style of music in a city dominated by XMETALX Bands. The band stuck out like sore thumbs and was one that people remembered when they left the venue. Earning more fans with more shows throughout the Summer encouraged the band to write new songs. They headed into the studio in early 2009. The band released Read My Palm, Revenant in June 2009 with their record release show at The Glasshouse in Pomona, CA. The LP was a big change in the bands style and sound. After gaining more attention from the LP, The band started to get reviews from various Websites and Blogs including opening for bigger bands such as Weatherbox and Mike Mains and The Branches."}] ,
    "Steps to Zion": [{"bio":"No bio avaliable"}] ,
    "Stillwinter": [{"bio":"The Stillwinter is a six-piece band out of Redlands, California. Their brand of alternative rock has its roots in pop punk but with dual guitars and keyboards adds a twist of piano and dance rock to their sound, which has been likened to a mix of Panic! At The Disco, Blink 182 and Paramore. Founded in 2010 by frontman Kelly Tittor and guitarist Cameron Terry, The Stillwinter has always centered around telling stories of life, love and loss. Over the next 3 years, the addition of Richie Koepsell on bass, David Strickland on guitar and vocals, Dean DiTrapani on drums and vocals, and classically trained pianist, Austin Clay on keys / synth has molded the music into a set that has audiences singing along, dancing and even headbanging by the end of the show. Some of The Stillwinters more notable shows and accomplishments include playing at House of Blues in Downtown Disney (multiple times), opening for world famous, pop punk veterans Rufio, Eve 6, and Reel Big Fish as well as having their music aired on multiple college radios and X103.9 FM. Working with Grammy Award-winners Shawn Sullivan and John Vestman, The Stillwinter promises to deliver on the high expectations these hard working musicians have set for themselves while staying true to their philosophy that reaching millions with their music is more important than making millions with it."}] ,
    "Swiss Alps": [{"bio":"Swiss Alps is a four piece indie/folk band from Redlands. Their unique sound infuses African rhythms and melodic tones that blend into dreamy and catchy pop songs. Their dynamic live sound is driven by steady percussion and experimental arrangements. Although they have been playing together for just a few months, they show an exciting and mature sound that listeners are drawn to."}] ,
    "Tango Kilo": [{"bio":"Tango Kilo began with David Mancha and Randy Jordan who shared the common goal of making music which defined what they felt about the existing world. Mancha and Jordan incorporated Robbie Kauffman to create a dynamic hub of musical sound in the free-flowing-jam-band style. As the songs began to evolve so did the musical direction, which was not complete until bassist Jeremy Lacey was added to the fray. With their band intact Tango Kilo strives to create classic, yet modern American music."}] ,
    "Tatonka": [{"bio":"Tatonka is a southern California based girl/guy rock outfit that has been together a little over 2 years. They're sound is destined to change the face of music completely. They have a dynamic and unique ability to write catchy and heartfelt songs reminiscent of Queen and Fleetwood Mac, even though they are still young and in their early 20's. Tatonka will steal your heart and make your ears bleed with delite on such amazing anthems as Unfinished Life and Took The Road. Be the first one on your block to know about these future megastars that are just now getting critical acclaim from labels, venues, and other bands."}] ,
    "Teleplay": [{"bio":"Tango Kilo began with David Mancha and Randy Jordan who shared the common goal of making music which defined what they felt about the existing world. Mancha and Jordan incorporated Robbie Kauffman to create a dynamic hub of musical sound in the free-flowing-jam-band style. As the songs began to evolve so did the musical direction, which was not complete until bassist Jeremy Lacey was added to the fray. With their band intact Tango Kilo strives to create classic, yet modern American music."}] ,
    "Terry Linen": [{"bio":"Terry Linen is easily one of reggae musics greatest talents to have emerged in the new millennium. Blessed with a brilliantly distinctive voice, this diminutive singer has cemented a place in the hearts of reggae lovers worldwide with his hit songs, with their haunting melodies and wonderful songwriting. Born Kiplin Simpson, Linen grew up in the district of Red Bank, where he attended the Red Bank Primary and Red Bank High schools. Being the first child for his mother, his grandparents raised him, while his mother went out to hustle to put food on the table for him and his five siblings. In his early years, Linens father migrated to England. Eventually, Terry moved from the quiet district of Red Bank, to the sleepy bustle of Mandeville, to live with his mother who had remarried. After graduating from school, Linen hooked up with the legendary Black Kat sound system where he cut dubs. It was during those inspirational Black Panther days, that Linen became good friends with local artistes who were on the rise, including General Degree, Tony Rebel and Garnet Silk, who had a tremendous influence on the impressionable singer. Linen also met two of the most influential people of his career, Tyrone Taylor & Courtney Melody. Eventually, Linens close bond with General Degree began to pay dividends, as Degree invited Linen to the studio with him on several occasions, introducing him to influential movers and shakers in the music business. In the meantime, Linen also met a wealthy local bus owner from Southfield, St. Elizabeth called Million who persuaded him to join his sound of the same name, where he went on to cut the tune Sweet Cassandra on Millions own label."}] ,
    "That Art Thou": [{"bio":"That Art Thou is an indie folk band from Riverside, California. Formed in 2010, it is comprised completely of collegiate musicians who have been friends since childhood. Blending the raw vocals and lyrics of singer Jaron Paschke with the progressive instrumentals of guitarist Michael Perez, bassist Ryen Fonseca, and drummer Jake Reece, the group strives to bring real back to todays music scene through its intimate recordings and shows. Always down to earth and never disingenuous, That Art Thou is an up and coming force to be reckoned with that will undoubtedly capture the hearts of anyone who has ever experienced the good and bad of love, war, religion, and life."}] ,
    "The 3rd Degree": [{"bio":"The 3rd Degree was formed in early 2007 when singer Nathan Reign teamed up with guitarist Eric Ybarra, guitarist Jason Turk, drummer Dustin Feldmann and bassist Jimmy Carroll, the band was formed and quickly began writing material, playing their first showcase after only 2 weeks of being together. Since their inception The 3rd Degree has played many of Southern Californias biggest and most popular venues bringing a high energy stage show and powerful hook filled songs to Los Angeles hot spots The Whisky A Go-Go, The Viper Room, The Roxy, The House of Blues and BB Kings to name a few. They have also been in numerous Battle of the Bands competitions and have won multiple times including being involved in the Bodog Battle of the Bands and have been asked to play the LA Music Awards. They have recently sparked the interest of some major labels, management and booking agencies and have been featured in many local magazines and newspapers. The 3rd Degree has never been more complete and has become a local staple in the music scene and continues to outperform all other acts they play with time after time. The 4 piece group has rocked the stage with many great bands including The Vandals, Gorilla Biscuits, Strung Out, Death By Stereo, Bleeding Through, and Jeffery Star to name a few. No matter the venue, The 3rd Degree hits the audience with an unrelenting stage show and dynamic sounds that will leave you wanting more."}] ,
    "The Backseat Pilots": [{"bio":"No bio avaliable"}] ,
    "The C2B Project": [{"bio":"No bio avaliable"}] ,
    "The Cure": [{"bio":"No bio avaliable"}] ,
    "The Coyote Bandits": [{"bio":"No bio avaliable"}] ,
    "The Doors": [{"bio":"The Doors were an American rock band which formed in Los Angeles, California, United States in 1965. The band consisted of Jim Morrison (vocals), Ray Manzarek (organ), Robby Krieger (guitar) and John Densmore (drums). In this configuration, the band released six albums, all of which were successful and reached #1 on the Billboard Hot 100 twice, with 1967s Light My Fire and 1968s Hello, I Love You. After Morrisons death in 1971, the band continued on as a trio, releasing two more albums that were ignored commercially and disliked critically before disbanding in 1973. UCLA film school students Jim Morrison and Ray Manzarek had known each other at college and met by chance on Venice beach in July 1965. Morrison told Manzarek he had been writing songs and, at Manzareks encouragement, sang Moonlight Drive. Manzarek immediately suggested they form a band. Keyboardist Ray Manzarek was already in the band called Rick And The Ravens with Morrison and his brother Rick Manzarek while Robby Krieger and John Densmore were playing with The Psychedelic Rangers, and knew Manzarek from shared meditation instruction. In August Densmore joined the group and, along with members of the Ravens and an unidentified female bass player, recorded a six-song demo on September 2. This was widely bootlegged and appeared in full on the 1997 Doors box set. That month the group recruited talented guitarist Robby Krieger and the final lineupMorrison, Manzarek, Krieger and Densmorewas complete. Manzarek solved their lack of bassist by playing bass on a Fender Rhodes bass keyboard with his left hand and keyboards with his right hand."}] ,
    "The Fling": [{"bio":"The Flingan honest and ambitious four-piece from Long Beach, Calif.will self-release their first full-length record When The Madhouses Appear on their own label, Lady Monk Records, in stores Aug. 27 and digitally Aug. 31. Recorded by local wizard Matt Wignall (Cold War Kids, Deep Sea Diver) and engineered by Los Angeles technical guru Raymond Richards (Local Natives, The Henry Clay People), the album was carefully crafted to meet the demands of all involved. Dustin Lovelis (guitar, vocals) wrote from a young age and collaborated with brother Graham Lovelis (bass, vocals), but it wasnt until 2007 that Dustin took the project and pushed it center. The Lovelis boys extracted The Flings name from a band their father founded in his twenties which split shortly after Dustin was born, but the Lovelis brotherspartnering with Justin Ivey (drums) and Justin Roeland (guitar, keys, vocals)are carrying out The Fling legacy and have been writing, recording and touring together since 2008. With several regional and national tours behind them, a five-song EP (Ghost Dance) and a 7-inch (Out Of My Head) all attracting critical acclaim, The Fling has garnered a loyal following across the Southland. Theyve shared the stage with the likes of Dawes, The Growlers and fellow Long Beach bands Delta Spirit, Avi Buffalo and We Barbarians. When The Madhouses Appear taps into the dark and strange ethos of the individuals within the band while managing to capture the bliss that only the weary can oblige, with the vulnerability of Elliott Smith, the deep, old grit of The Pretty Things and the apathetic bite of the Pixies. The Flings new album tremors with the clashing of chaotic walls of sound attempting to strangle the silence, resulting in a delicate balance of ethereal maniaÉand if you ask the band, they wouldnt have it any other way."}] ,
    "The Game": [{"bio":"No bio available "}] ,
    "The Gentlephones": [{"bio":"No bio avaliable"}] ,
    "The Ghetto Prophet": [{"bio":"No bio avaliable"}] ,
    "The Greater Height": [{"bio":"No bio avaliable"}] ,
    "The Guestimates": [{"bio":"No bio avaliable"}] ,
    "The Jazz Masters": [{"bio":"No bio avaliable"}] ,
    "The Machine Age": [{"bio":"The Machine Age is an Indie/Alt/Rock band from Riverside, Ca. Consisting of Bass Guitarist/Lead Singer: Andrew Williams, Guitarist/Backup Vocals: Dave Riem and Drums/Percussion: Beau Mony. The Band was formed in 2010. Be on the lookout for The Machine Age in you area!"}] ,
    "The Maxies": [{"bio":"The Maxies illegally relocated to your sunny South California to show how make best SUPER PUNK ROCK PARTY and spread MAXIE MANIA!! They are biggest band in GREENLAND and shitty North Western Europe. They bring CHAOTIC POWER POP PUNK ROCK to make dancing for one and all. They punch American punk rockers and American rude boys right in cocksucker. GREENLAND punk rockers and rude boys more much dangerous. Greenland lose many Maxies to immigration. But THE MAXIES are like disease transmitted sexual to come back in smuggled package smelling like fish. They hope loving to see many cute American girls and very sexy American boys at those SUPER PUNK ROCK PARTIES!! Maxies tell that brings much warmth to ice cold hearts. The band of The Maxies always has the top 10 on Greenland radio and G-MTV. They have two songs in top 40 for Finland, Denmark and Sweden. In GREENLAND, we SUPER PUNK ROCK PARTY with your bands that beg to join (Coldplay, Green Day, Slipknot, U2, Alkaline Trio, Muse, Kid Rock, 30 Seconds to Mars, Blink 182, Madonna, Nickleback, Sum 41, NIN, The Killers, Rammstein, The Who, etc.). These bands sucks next to Maxie talent. In U.S. and A., Maxies can throw SUPER PUNK ROCK PARTIES with many much queercore bands (Reel Big Fish, Narcoleptic Youth, Adolescents, Voodoo Glow Skulls, Adicts, Re-Volts, Knock-Out, D.I., The Exploited, The Dopamines, Super Nova, Sham 69, Angry Samoans, Agent Orange, Dead Kennedys). THE MAXIES are more famous than these. The Maxies much true kings of ROCK. More PUNK than ROCK. More ROCK than PUNK!! If you dont like Maxies, then your taste is only in your mouth! They have will be in U.S. and A. until are deported. They are soon to be for your top 10 radio. They will be bigger and better than your famous Black Flag, Bad Religion or shitty REM. Get ready for best thing you have ever heard! MAXIES RULE!!"}] ,
    "The Mirror": [{"bio":"No bio avaliable"}] ,
    "The Motel Life": [{"bio":"Since their Formation in the winter of 2007, the members of The Motel Life have continued to make a name for themselves in their short existence. With an ear pleasing blend of rock, 90s alternative and tasteful hints of pop, The Motel Life have managed to create something raw, real and mature. With several out of state tours, a long list of local shows, a well received debut EP, and a strong response from both fans and critics, The Motel Life have reached the peak of their local status and now plan on taking their talent to a new level. With the release of their most recent first full-length album, Retreat, the members of The Motel Life, Michael Escanuelas, Judcody Limon, Nick Camacho, Al Hernandez and Ray Markel, plan to reach out to new fans and have their music heard. Named as one of absolutepunk.nets top 100 bands to look out for in 2010, The Motel Life is setting the bar higher than ever before."}] ,
    "The Nervous Wreckords": [{"bio":"Let Them All Talk is the forthcoming and first national release from Californias The Nervous Wreckords (features Brian Karscig of LOUIS XIV). Indie Pop is not a favorite description of the band, but with catchy guitar riffs, sass fueled lyrics, melodic choruses and beats that dance, its hard to not call it pop music. Recorded on all Neve and 60s and 70s gear and equipment in a home studio by the band, it cant be called anything but independent. Flavors of T-Rex, Prince, and even some AC/DC appear in their sound, but with an approach that is uniquely their own. Breakups, jealousy, beauty, and confidence, (with a healthy dose of sexual tension) is all rolled into an album that sounds like a party you shouldve been at. In the 2 years since their formation, theyve toured and played with The Killers, Cee-Lo Green, Brandon Flowers, Florence and the Machine, Death Cab for Cutie, the Naked and Famous, and many more. The 2012-year has started with The Nervous Wreckords finishing their album, touring with Weezer, Yuck, Antlers and Wavves through the Caribbean, and preparing for their own US/Canadian tour late Spring"}] ,
    "The New Division": [{"bio":"The New Division began as a college dorm room project for songwriter John Kunkel back in 2005. After moving from Uruguay (where he resided for 18 years) to Southern California. Kunkel began experimenting with synthesizers after being heavily influenced by the sounds of Joy Division, New Order, and Depeche Mode. Originally, the name New Division was meant as an artist working title for songs that would never be released. Within a few months Kunkel developed a series of songs that attracted other fellow college students at California Baptist University. By the end of 2007, the one man New Division project had transformed into a four piece. Michael Janz (aka Janzie by friends) was the first member to be added after Kunkel discovered the two shared common interests in musical tastes. Shortly thereafter Brock Woolsey and Mark Michalski were added to the band."}] ,
    "The Shape Of The Earth": [{"bio": "Singer/Songwriter Gavin Bascom self-released his debut EP They would at Least Stay Busy under the name The Shape Of The Earth in the summer 2008. The critical acclaim and enthusiasm Bascom had garnered through live performances and a strong online presence quickly created a local and international buzz across the nation. The introspective and fiercely personal set of songs became considered soundtrack potential gold, and was noticed by Lisa Donovan (Zappin productions), featured the final song on the EP Epilogue in a video written for YouTubes YTLive event in fall 2008. The video garnered over 700,000 plays in a matter of months, landing this debut EP in the top 100 albums on iTunes, an impressive feat for any debut songwriter. Bascom has since added a full lineup including long time friend and songwriter Kevin Hull, and ex drummer from the former Pop Rock band Faulter Rich Boutwell. In the winter of 2009, the group entered the studio to record their debut LP, Do I Dare Disturbed the Universe?, with producer/song writer Andy Carpenter at Jon St. James famous Casbah Recording Studio. Bascom said, The new album is a natural progression for me, it started from the intimate stripped down kind of bedroom stuff that Ive always been writing, but weve incorporated all the things the new members have to offer, and it really comes out sounding full and powerful. The new record truly maintains the personality and intimacy of his poignant lyrics but permeates the sound-scape in a way that speaks volumes both musically and emotionally. Jason Upright (EMI, Captiol, Revelation, Abacus, Superhero Artist Management, and DMI) had this to say about the new TSOTE release, ...simple enough to not overwhelm the listener, but yet also incorporate[s] enough variation and quirkiness to keep it interesting...in a sea of Indie Rock sameness, TSOTE rises above and stands out from the rest of the flotsam and jetsam."}] ,
    "The Shake Up": [{"bio":"Coming from a town where Hip-Hop and Hardcore music reign, come a group who are no strangers to this harsh music scene. The Shake Up is a band that refuses to let that element stop them from breaking out. With a lineup whos musical influences spread across the map, The Shake Up combines these influences to bring a sincere sound to the Pop Rock scene. Catchy melodies and down to earth lyrics from REAL experiences that any one of any age can relate to. Each member has been through the ups and downs of making music and being in and out of bands since a high school age. Each member has been through their phases and has now brought their maturity to the table and has realized what they all want to write. Solid,catchy,and upbeat music. With their live performance being just as energetic as the heavier genres. The Shake Up is here, and here to stay for a long time no matter the circumstances."}] ,
    "The Shival Experience": [{"bio":"No bio avaliable"}] ,
    "The Sleeping Sea King": [{"bio":"If Queens Of The Stone Age and Mastodon had drunken, unprotected sexual relations, TSSK would be the bastard offspring. Straight up, no frills rock n roll, soulful vocals, face melting leads, rock solid rhythm section. TSSK is loud, fun and to the point."}] ,
    "Them Novus": [{"bio":"THEM NOVUS was formed in Riverside, California, in early 2007. Johnny Gomez, Henry Rodriguez and Devin Vasquez were united to form THEM NOVUS. Immediately, the artistic juices began flowing between Devin and johnnyG (who wrote Hear It hanging out after rehearsal one night), and that chemistry still flows to this day along with groove maestro Henry Rodriguez, The band draws from various styles influenced by The Police, Dave Matthews Band, Jamiroquai, Incubus, and a few more. With the support of the fans, THEM NOVUS is striving for longevity, creativity, and ingenuity. Like they say at the Grammys Without you, this would not be possible. Well see you there. STAY TUNED!"}] ,
    "Toots & The Maytals": [{"bio":"No bio avaliable"}] ,
    "Tribal Seeds": [{"bio":"From San Diego, California, award-winning reggae group Tribal Seeds have become known for their spiritually driven, refreshing rock vibe they have infused with the roots style of reggae music. Originally started by two brothers, Steven Rene Jacobo (lyrics, lead vocals, guitar) and Tony-Ray Jacobo (producer, keyboards), Tribal Seeds now boats six members, including: Carlos Verdugo (drums), Jose Rodriguez (guitar), Victor Navarro (bass) & E.N Young (keys, back up vocals). Tribal Seeds unmatched musical talent and authentic sound has brought them to the forefront of the reggae rock genre, as their art form has reached people of all ages across the United States, and worldwide. The bands self titled debut album, Tribal Seeds was released in 2008, and their second album The Harvest was released in June of 2009. iTunes named both albums the Best Of in the Reggae genre, for their respected years. Their debut album helped garner them the Best World Music title at the San Diego Music Awards in 2008, and The Harvest, which contained fourteen new and original songs, debuted at the number 5 spot on the Billboard Reggae Charts. The tracks, written and produced by Tribal Seeds, were recorded and mixed by Alan Sanderson at Signature Sound Studios in San Diego, and mastered by Erik Lobson at Universal Mastering. On July 19, 2011, Tribal Seeds gave listeners a brand new EP entitled Soundwaves, which peaked at number 2 on the Billboard Reggae Charts. The band notes that the album was inspired by their life experiences, being on tour, and their desire to inspire youth to raise their voices and seek a higher consciousness. Tribal Seeds have toured throughout the United States including Hawaii & Guam, and have also performed in Mexico & Aruba. They have shared the stage with artists such as Dave Mathews Band, Jack White, Red Hot Chili Peppers, Janes Addiction, Skrillex, MGMT, Cee Lo Green, Jason Mraz, Matisyahu, Sublime with Rome, Taking Back Sunday, O.A.R., Pretty Lights, Pepper, Collie Buddz, The Wailers, Julian Marley, Stephen Marley, Gregory Issacs, SOJA, Rebelution, and many more."}] ,
    "True Heart's Madness": [{"bio":"No bio avaliable"}] ,
    "VCR Monster": [{"bio":"No bio avaliable"}] ,
    "We Are The Arsenal": [{"bio":"We Are The Arsenal is a musical quartet which formed in Orange County, CA in early 2007. Since its inception, the band has made a name for itself by releasing quality rock music, keeping a very personal relationship with their fans, and putting on explosive live performances. Fueled by nothing more than a true passion for music and a love of what they do, the members of WATA have never strived to be anything that they are not. The simple appreciation of good melodies, honest lyrics, and good old-fashioned rock and roll are the drive behind the rock anthems found on both current releases by the band. With the release of the bands debut EP known simply as The Trees in February 2008, came the attention of Japanese based record label RadTone Music as well as US based Authentik Artists. The teaming with both companies led to the eventual release of We Are The Arsenals debut full-length album entitled They Worshipped The Trees in March of 2009. We are song-writers. We are musicians. We believe a great hook, a beautiful melody, an honest lyric, and the simplicity of a great song can change the world. Playing music on stage is why we are alive. We do this for the music. We do this for ourselves. We do this for you. We Are The Arsenal."}] ,
    "We Shot The Moon": [{"bio":"While its common practice in rock bios to liken an act to something familiar, its hard to do that with San Diegos We Shot The Moon. Thats because its virtually impossible to compare them to any other band out thereÉnot for more than a track or two, at least. We Shot The Moonled by former Waking Ashland frontman Jonathan Jonesis a piano-heavy indie rock five-piece that formed in the year 2007. On September 29, the band releases its infectious sophomore LP, A Silver Lining, the follow-up to 2008s Fear and Love, on Minneapolis-based label Afternoon Records. But if you require a description of the band before reading more about We Shot The Moon, lets just say that A Silver Lining possesses shades of Jacks Mannequin, Coldplay, Switchfoot, Muse, and Weezer. According to Jones, the band specializes in quirky rock thats layered, thick, and replete with ambient noise, and its for that reason we fall through the cracks, which I think, ultimately, is a good thing. We dont fit in to the the super-indie hipster crowd. Were not gimmickywere real, we hit wrong notes live and thats ok. Born not long after the death of Jones previous band, Waking Ashland, which dissolved amid internal strife and struggle, We Shot The Moon ended what was four months of musical limbo for Jones. I was working this terrible pizza delivery job, and I was literally washing dishes when I got this call from my friend (Sherwoods) Dan (Koch), and he asked me what I was doing, so I told himÉWell, Im washing dishes, Dan, recalls Jones. But Koch told him he shouldnt be driving large pies all around town, because he wasnt done playing music."}] ,
    "What Hands Are For": [{"bio":"Rock stars are dead. What Hands Are For knows this. Music is a communal experience between listener and player, and the arbitrary superiority fame supplies is counter productive to the bond. This is why What Hands Are For has self released its EPs Loud Ass and ...Please Believe Me, and made both available to download at any price a fan wants. They want everyone to hear their music without the obligation of owing something in return. This is why they play as many shows they can for anyone who is interested, whether it be a birthday party with nachos and sandwiches, or an opening slot for The Bled, Of Mice and Men or Rufio. Regardless of the crowd, they play from the heart. What Hands Are For formed in 2006 with the desire to play something different from what was going on in San Bernardino, CA. They loved The Smiths, Big L, At The Drive-In, Clipse, Fugazi, Boyz 2 Men, and The Kinison. They quickly cut their own niche into the break-down laden, riff heavy, pig squeeling scene they grew up in. After releasing Loud Ass they booked their own tour from Los Angeles to Seattle in 2008. Local stations X103.9 and KROQ 106.7 began to play them on their locals only showcases. College caused time constraints that forced the band to slow down in 2009 and left listeners with no new music until 2010. ...Please Believe Me was released in March 2010 and has been getting attention from small online zines across the web. They are currently working on new music for their next EP due out late fall/early winter, working on creating tour opportunities, and playing shows for anyone who will listen."}] ,
    "Ziggi": [{"bio":"No bio avaliable"}] ,
    "Zion I": [{"bio":"Zion I is a hip hop duo from Oakland, California, USA, consisting of producer/DJ, Amplive and MC Zumbi. The group is known to its followers for Amps futuristic production techniques, using a mix of live instrumentation and samples, and Zumbis positive and socially conscious lyrics. Zion I debuted in 1997 with the locally distributed cassette-only EP Enter the Woods. Their first single on Indie label Ground Control Records (Inner Light) paved the way for an album deal and in 2000, they released the critically acclaimed Mind Over Matter. In total, they have released six studio albums, 2000s Mind Over Matter, 2003s Deep Water Slang V2.0, 2005s True & Livin, 2006s Break a Dawn (a Japan exclusive), also in 2006 an album with The Grouch, Heroes in the City of Dope, 2009s The Take Over, 2010s Atomic Clock, and their newest collaborative album with The Grouch, Heroes in the Healing of the Nation.After signing with independent label Ground Control Records, the duo released their debut single Inner Light in 1998, along with their debut EP Starship. In 1999, they released their next single Critical featuring Planet Asia, and another EP, Chapter 4. Their debut album Mind Over Matter finally surfaced in 2000."}]};
